-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1
-- Время создания: Янв 16 2025 г., 14:33
-- Версия сервера: 9.1.0
-- Версия PHP: 8.3.15

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `fed_project`
--

-- --------------------------------------------------------

--
-- Структура таблицы `banks`
--

CREATE TABLE `banks` (
                         `ID` int UNSIGNED NOT NULL,
                         `bank_code` varchar(5) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci DEFAULT NULL,
                         `bank_name` varchar(71) CHARACTER SET utf8mb3 COLLATE utf8mb3_general_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `banks`
--

INSERT INTO `banks` (`ID`, `bank_code`, `bank_name`) VALUES
                                                         (1, '00001', 'Межбанковский Центр расчетов Центрального банка'),
                                                         (2, '00002', 'Клиринговый центр розничных платежей Центрального банка'),
                                                         (3, '00003', 'Клиринговый центр мгновенных платежей Центрального банка'),
                                                         (4, '00014', 'Расчетно-кассовый центр Центрального банка по г. Ташкенту'),
                                                         (5, '00015', 'Расчетно-кассовый центр Центрального банка по Республике Каракалпакстан'),
                                                         (6, '00016', 'Расчетно-кассовый центр Центрального банка по Андижанской области'),
                                                         (7, '00017', 'Расчетно-кассовый центр Центрального банка по Бухарской области'),
                                                         (8, '00018', 'Расчетно-кассовый центр Центрального банка по Джизакской области'),
                                                         (9, '00019', 'Расчетно-кассовый центр Центрального банка по Кашкадарьинской области'),
                                                         (10, '00020', 'Расчетно-кассовый центр Центрального банка по Навоийской области'),
                                                         (11, '00021', 'Расчетно-кассовый центр Центрального банка по Наманганской области'),
                                                         (12, '00022', 'Расчетно-кассовый центр Центрального банка по Самаркандской области'),
                                                         (13, '00023', 'Расчетно-кассовый центр Центрального банка по Сырдарьинской области'),
                                                         (14, '00024', 'Расчетно-кассовый центр Центрального банка по Сурхандарьинской области'),
                                                         (15, '00025', 'Расчетно-кассовый центр Центрального банка по Ташкентской области'),
                                                         (16, '00026', 'Расчетно-кассовый центр Центрального банка по Ферганской области'),
                                                         (17, '00027', 'Расчетно-кассовый центр Центрального банка по Хорезмской области'),
                                                         (18, '00031', 'Пахтаабадский филиал АКБ \"Агробанк\"'),
                                                         (19, '00033', 'Асакинский филиал АКБ \"Агробанк\"'),
                                                         (20, '00035', 'Мархаматский филиал АКБ \"Агробанк\"'),
                                                         (21, '00037', 'Шахриханский филиал АКБ \"Агробанк\"'),
                                                         (22, '00040', 'Джалакудукский филиал АКБ \"Агробанк\"'),
                                                         (23, '00042', 'Ходжаабадский филиал АКБ \"Агробанк\"'),
                                                         (24, '00045', 'Избасканский филиал АКБ \"Агробанк\"'),
                                                         (25, '00049', 'Алтынкульский филиал АКБ \"Агробанк\"'),
                                                         (26, '00053', 'Бустонский филиал АКБ \"Агробанк\"'),
                                                         (27, '00055', 'Улугнорский филиал АКБ \"Агробанк\"'),
                                                         (28, '00056', 'Кургантепинский филиал АКБ \"Агробанк\"'),
                                                         (29, '00059', 'Андижанский областной филиал АКИБ \"Ипотека-банк\"'),
                                                         (30, '00062', 'Андижанский филиал АКБ \"Агробанк\"'),
                                                         (31, '00064', 'Булакбашинский филиал АКБ \"Агробанк\"'),
                                                         (32, '00066', 'Балыкчинский филиал АКБ \"Агробанк\"'),
                                                         (33, '00068', 'Филиал \"Истиклол\" АКИБ \"Ипотека-банк\"'),
                                                         (34, '00069', 'Андижанский филиал АО \"Асакабанк\"'),
                                                         (35, '00073', 'Бабурский филиал АО \"Асакабанк\"'),
                                                         (36, '00074', 'Андижанское отделение Узнацбанка'),
                                                         (37, '00077', 'Андижанский областной территориальный филиал АКБ \"Агробанк\"'),
                                                         (38, '00083', 'Головной офис АКБ \"Hamkorbank\"'),
                                                         (39, '00088', 'Бухарский областной филиал АКИБ \"Ипотека-банк\"'),
                                                         (40, '00089', 'Бухарский областной территориальный филиал АКБ \"Агробанк\"'),
                                                         (41, '00090', 'Алатский филиал АКБ \"Агробанк\"'),
                                                         (42, '00091', 'Вабкентский филиал АКБ \"Агробанк\"'),
                                                         (43, '00092', 'Гиждуванский филиал АКБ \"Агробанк\"'),
                                                         (44, '00093', 'Шафирканский филиал АКБ \"Агробанк\"'),
                                                         (45, '00094', 'Каракульский филиал АКБ \"Агробанк\"'),
                                                         (46, '00095', 'Ромитанский филиал АКБ \"Агробанк\"'),
                                                         (47, '00096', 'Жондорский филиал АКБ \"Агробанк\"'),
                                                         (48, '00097', 'Бухарский филиал АКБ \"Агробанк\"'),
                                                         (49, '00098', 'Пешкунский филиал АКБ \"Агробанк\"'),
                                                         (50, '00119', 'Филиал \"Сардор\" АКИБ \"Ипотека-банк\"'),
                                                         (51, '00120', 'Бухарский  филиал АО \"Асакабанк\"'),
                                                         (52, '00121', 'Джизакское отделение Узнацбанка'),
                                                         (53, '00122', 'Джизакский областной филиал АКИБ \"Ипотека-банк\"'),
                                                         (54, '00123', 'Джизакский филиал АКБ \"Агробанк\"'),
                                                         (55, '00124', 'Арнасайский филиал АКБ \"Агробанк\"'),
                                                         (56, '00125', 'Зарбдарский филиал АКБ \"Агробанк\"'),
                                                         (57, '00126', 'Джизакский областной территориальный филиал АКБ \"Агробанк\"'),
                                                         (58, '00127', 'Пахтакорский филиал АКБ \"Агробанк\"'),
                                                         (59, '00128', 'Галлааральский филиал АКБ \"Агробанк\"'),
                                                         (60, '00129', 'Дустликский филиал АКБ \"Агробанк\"'),
                                                         (61, '00130', 'Мирзачульский филиал АКБ \"Агробанк\"'),
                                                         (62, '00131', 'Заминский филиал АКБ \"Агробанк\"'),
                                                         (63, '00132', 'Бахмальский филиал АКБ \"Агробанк\"'),
                                                         (64, '00133', 'Фаришский филиал АКБ \"Агробанк\"'),
                                                         (65, '00134', 'Зафарабадский филиал АКБ \"Агробанк\"'),
                                                         (66, '00140', 'Джизакский  филиал АО \"Асакабанк\"'),
                                                         (67, '00151', 'Кашкадарьинский областной территориальный филиал АКБ \"Агробанк\"'),
                                                         (68, '00157', 'Гузарский филиал АКБ \"Агробанк\"'),
                                                         (69, '00158', 'Дехканабадский филиал АКБ \"Агробанк\"'),
                                                         (70, '00160', 'Камашинский филиал АКБ \"Агробанк\"'),
                                                         (71, '00162', 'Касанский филиал АКБ \"Агробанк\"'),
                                                         (72, '00165', 'Шахрисабзский филиал АКИБ \"Ипотека-банк\"'),
                                                         (73, '00166', 'Шахрисабзский филиал АКБ \"Агробанк\"'),
                                                         (74, '00169', 'Яккабагский филиал АКБ \"Агробанк\"'),
                                                         (75, '00172', 'Каршинский филиал АКБ \"Агробанк\"'),
                                                         (76, '00174', 'Чиракчинский филиал АКБ \"Агробанк\"'),
                                                         (77, '00176', 'Китабский филиал АКБ \"Агробанк\"'),
                                                         (78, '00179', 'Касбинский филиал АКБ \"Агробанк\"'),
                                                         (79, '00181', 'Нишанский филиал АКБ \"Агробанк\"'),
                                                         (80, '00184', 'Миришкорский филиал АКБ \"Агробанк\"'),
                                                         (81, '00187', 'Мубарекский филиал АКБ \"Агробанк\"'),
                                                         (82, '00190', 'Кашкадарьинский областной филиал АКИБ \"Ипотека-банк\"'),
                                                         (83, '00194', 'Каршинский  филиал АО \"Асакабанк\"'),
                                                         (84, '00197', 'Навоийский областной территориальный филиал АКБ \"Агробанк\"'),
                                                         (85, '00199', 'Навоийский филиал АИКБ \"Ипак Йули\"'),
                                                         (86, '00201', 'Навоийский городской филиал АО \"Гарант банк\"'),
                                                         (87, '00203', 'Зарафшанский филиал АКИБ \"Ипотека-банк\"'),
                                                         (88, '00205', 'Навоийский филиал АКИБ \"Ипотека-банк\"'),
                                                         (89, '00206', 'Навоийский  филиал АО \"Асакабанк\"'),
                                                         (90, '00209', 'Канимехский филиал АКБ \"Агробанк\"'),
                                                         (91, '00210', 'Карманинский филиал АКБ \"Агробанк\"'),
                                                         (92, '00212', 'Кызылтепинский филиал АКБ \"Агробанк\"'),
                                                         (93, '00214', 'Нуратинский филиал АКБ \"Агробанк\"'),
                                                         (94, '00216', 'Тамдынский филиал АКБ \"Агробанк\"'),
                                                         (95, '00217', 'Навбахорский филиал АКБ \"Агробанк\"'),
                                                         (96, '00219', 'Хатырчинский филиал АКБ \"Агробанк\"'),
                                                         (97, '00222', 'Наманганское отделение Узнацбанка'),
                                                         (98, '00223', 'Наманганский областной филиал АКИБ \"Ипотека-банк\"'),
                                                         (99, '00225', 'Наманганский филиал АКБ \"Агробанк\"'),
                                                         (100, '00227', 'Наманганский городской филиал АО \"Гарант банк\"'),
                                                         (101, '00231', 'Наманганский  филиал АО \"Асакабанк\"'),
                                                         (102, '00232', 'Мингбулакский филиал АКБ \"Агробанк\"'),
                                                         (103, '00234', 'Касансайский филиал АКБ \"Агробанк\"'),
                                                         (104, '00236', 'Нарынский филиал АКБ \"Агробанк\"'),
                                                         (105, '00238', 'Папский филиал АКБ \"Агробанк\"'),
                                                         (106, '00241', 'Туракурганский филиал АКБ \"Агробанк\"'),
                                                         (107, '00244', 'Уйчинский филиал АКБ \"Агробанк\"'),
                                                         (108, '00246', 'Учкурганский филиал АКБ \"Агробанк\"'),
                                                         (109, '00249', 'Чустский филиал АКБ \"Агробанк\"'),
                                                         (110, '00251', 'Янгикурганский филиал АКБ \"Агробанк\"'),
                                                         (111, '00253', 'Наманганский филиал АКБ \"Агробанк\"'),
                                                         (112, '00256', 'Чартакский филиал АКБ \"Агробанк\"'),
                                                         (113, '00259', 'Давлатабадский филиал АКБ \"Агробанк\"'),
                                                         (114, '00262', 'Куксарайский филиал АКИБ \"Ипотека-банк\"'),
                                                         (115, '00264', 'Самаркандский  филиал АО \"Асакабанк\"'),
                                                         (116, '00265', 'Акдарьинский филиал АКБ \"Агробанк\"'),
                                                         (117, '00267', 'Нарпайский филиал АКБ \"Агробанк\"'),
                                                         (118, '00270', 'Джамбайский филиал АКБ \"Агробанк\"'),
                                                         (119, '00273', 'Пастдаргомский филиал АКБ \"Агробанк\"'),
                                                         (120, '00275', 'Каттакурганский филиал АКБ \"Агробанк\"'),
                                                         (121, '00278', 'Самаркандское отделение Узнацбанка'),
                                                         (122, '00279', 'Самаркандский областной территориальный филиал АКБ \"Агробанк\"'),
                                                         (123, '00280', 'Сиёбский филиал АКБ \"Агробанк\"'),
                                                         (124, '00283', 'Региональный филиал \"Умар\" АИКБ \"Ипак Йули\"'),
                                                         (125, '00290', 'Булунгурский филиал АКБ \"Агробанк\"'),
                                                         (126, '00291', 'Нурабадский филиал АКБ \"Агробанк\"'),
                                                         (127, '00297', 'Пахтачийский филиал АКБ \"Агробанк\"'),
                                                         (128, '00300', 'Ургутский филиал АКБ \"Агробанк\"'),
                                                         (129, '00307', 'Гузалкентский филиал АКБ \"Агробанк\"'),
                                                         (130, '00309', 'Иштыханский филиал АКБ \"Агробанк\"'),
                                                         (131, '00312', 'Самаркандский областной филиал АКИБ \"Ипотека-банк\"'),
                                                         (132, '00313', 'Кушрабадский филиал АКБ \"Агробанк\"'),
                                                         (133, '00318', 'Пайарикский филиал АКБ \"Агробанк\"'),
                                                         (134, '00321', 'Тайлякский филиал АКБ \"Агробанк\"'),
                                                         (135, '00325', 'Сурхандарьинский областной территориальный филиал АКБ \"Агробанк\"'),
                                                         (136, '00331', 'Байсунский филиал АКБ \"Агробанк\"'),
                                                         (137, '00332', 'Джаркурганский филиал АКБ \"Агробанк\"'),
                                                         (138, '00334', 'Музрабадский филиал АКБ \"Агробанк\"'),
                                                         (139, '00337', 'Шерабадский филиал АКБ \"Агробанк\"'),
                                                         (140, '00339', 'Шурчинский филиал АКБ \"Агробанк\"'),
                                                         (141, '00341', 'Узунский филиал АКБ \"Агробанк\"'),
                                                         (142, '00343', 'Ангорский филиал АКБ \"Агробанк\"'),
                                                         (143, '00345', 'Кизирикский филиал АКБ \"Агробанк\"'),
                                                         (144, '00347', 'Кумкурганский филиал АКБ \"Агробанк\"'),
                                                         (145, '00349', 'Термезский филиал АКБ \"Агробанк\"'),
                                                         (146, '00351', 'Алтынсайский филиал АКБ \"Агробанк\"'),
                                                         (147, '00355', 'Сариасийский филиал АКБ \"Агробанк\"'),
                                                         (148, '00356', 'Сурхандарьинский областной филиал АКИБ \"Ипотека-банк\"'),
                                                         (149, '00358', 'Термезинский  филиал АО \"Асакабанк\"'),
                                                         (150, '00360', 'Денауский филиал АКБ \"Агробанк\"'),
                                                         (151, '00363', 'Сырдарьинское отделение Узнацбанка'),
                                                         (152, '00364', 'Сырдарьинский областной филиал АКИБ \"Ипотека-банк\"'),
                                                         (153, '00365', 'Сырдарьинский областной территориальный филиал АКБ \"Агробанк\"'),
                                                         (154, '00373', 'Гулистанский  филиал АО \"Асакабанк\"'),
                                                         (155, '00374', 'Сардобский филиал АКБ \"Агробанк\"'),
                                                         (156, '00375', 'Сырдарьинский филиал АКБ \"Агробанк\"'),
                                                         (157, '00378', 'Янгиерский филиал АКБ \"Агробанк\"'),
                                                         (158, '00382', 'Баяутский филиал АКБ \"Агробанк\"'),
                                                         (159, '00383', 'Ширинский филиал АКБ \"Агробанк\"'),
                                                         (160, '00386', 'Гулистанский филиал АКБ \"Агробанк\"'),
                                                         (161, '00388', 'Сайхунабадский филиал АКБ \"Агробанк\"'),
                                                         (162, '00390', 'Акалтынский филиал АКБ \"Агробанк\"'),
                                                         (163, '00392', 'Хавастский филиал АКБ \"Агробанк\"'),
                                                         (164, '00394', 'Ташкентский городской филиал АКБ \"Агробанк\"'),
                                                         (165, '00395', 'АО \"Ziraat Bank Uzbekistan\"'),
                                                         (166, '00401', 'Головной офис АК \"Алокабанк\"'),
                                                         (167, '00408', 'Ташкентский областной филиал АКИБ \"Ипотека-банк\"'),
                                                         (168, '00411', 'Нурафшанский филиал АО \"Асакабанк\"'),
                                                         (169, '00413', 'Ахангаранский филиал АКБ \"Агробанк\"'),
                                                         (170, '00416', 'Пойтахтский филиал АО \"Асакабанк\"'),
                                                         (171, '00417', 'Автотранспортный филиал АО \"Асакабанк\"'),
                                                         (172, '00419', 'Ташкентский городской филиал АКИБ \"Ипотека-банк\"'),
                                                         (173, '00420', 'Мирабадский филиал АКИБ \"Ипотека-банк\"'),
                                                         (174, '00421', 'Мирзо Улугбекский филиал АИКБ \"Ипак Йули\"'),
                                                         (175, '00423', 'Мехнатский филиал АКИБ \"Ипотека-банк\"'),
                                                         (176, '00425', 'Шайхантаурский филиал АКИБ \"Ипотека-банк\"'),
                                                         (177, '00433', 'Головной офис АКБ \"Микрокредитбанк\"'),
                                                         (178, '00439', 'Головной офис АО \"Гарант банк\"'),
                                                         (179, '00440', 'Головной офис АКБ \"Узпромстройбанк\"'),
                                                         (180, '00444', 'Головной офис АИКБ \"Ипак Йули\"'),
                                                         (181, '00445', 'Ташкентский городской филиал АКБ \"Капиталбанк\"'),
                                                         (182, '00446', 'Головной офис АКБ \"Туронбанк\"'),
                                                         (183, '00450', 'Головной офис УзНацбанка'),
                                                         (184, '00454', 'Шайхонтохурский филиал АКБ \"Агробанк\"'),
                                                         (185, '00457', 'Аккурганский филиал АКБ \"Агробанк\"'),
                                                         (186, '00459', 'Алмалыкский филиал АКИБ \"Ипотека-банк\"'),
                                                         (187, '00461', 'Ангренский филиал АКИБ \"Ипотека-банк\"'),
                                                         (188, '00463', 'Букинский филиал АКБ \"Агробанк\"'),
                                                         (189, '00468', 'Бекабадский филиал АКБ \"Агробанк\"'),
                                                         (190, '00472', 'Пскентский филиал АКБ \"Агробанк\"'),
                                                         (191, '00474', 'Куйичирчикский филиал АКБ \"Агробанк\"'),
                                                         (192, '00475', 'Ташкентский областной территориальный филиал АКБ \"Агробанк\"'),
                                                         (193, '00476', 'Чиназский филиал АКБ \"Агробанк\"'),
                                                         (194, '00478', 'Чирчикский филиал АКИБ \"Ипотека-банк\"'),
                                                         (195, '00480', 'Юкоричирчикский филиал АКБ \"Агробанк\"'),
                                                         (196, '00482', 'Паркентский филиал АКБ \"Агробанк\"'),
                                                         (197, '00485', 'Янгиюльский филиал АКБ \"Агробанк\"'),
                                                         (198, '00487', 'Ахангаранский филиал АКИБ \"Ипотека-банк\"'),
                                                         (199, '00489', 'Бекабадский филиал АКИБ \"Ипотека-банк\"'),
                                                         (200, '00491', 'Головной офис ЧАБ \"Трастбанк\"'),
                                                         (201, '00493', 'Ферганское отделение Узнацбанка'),
                                                         (202, '00495', 'Ферганский областной территориальный филиал АКБ \"Агробанк\"'),
                                                         (203, '00502', 'Алтыарыкский филиал АКБ \"Агробанк\"'),
                                                         (204, '00504', 'Багдадский филиал АКБ \"Агробанк\"'),
                                                         (205, '00507', 'Ферганский филиал АКБ \"Агробанк\"'),
                                                         (206, '00510', 'Дангаринский филиал АКБ \"Агробанк\"'),
                                                         (207, '00511', 'Учкуприкский филиал АКБ \"Агробанк\"'),
                                                         (208, '00513', 'Бешарыкский филиал АКБ \"Агробанк\"'),
                                                         (209, '00515', 'Куштепинский филиал АКБ \"Агробанк\"'),
                                                         (210, '00517', 'Кувасайский филиал АКБ \"Агробанк\"'),
                                                         (211, '00519', 'Риштанский филиал АКБ \"Агробанк\"'),
                                                         (212, '00522', 'Ташлакский филиал АКБ \"Агробанк\"'),
                                                         (213, '00525', 'Бувайдинский филиал АКБ \"Агробанк\"'),
                                                         (214, '00528', 'Маргиланский филиал АКБ \"Агробанк\"'),
                                                         (215, '00529', 'Кувинский филиал АКБ \"Агробанк\"'),
                                                         (216, '00533', 'Узбекистанский филиал АКБ \"Агробанк\"'),
                                                         (217, '00539', 'Ферганский  филиал АО \"Асакабанк\"'),
                                                         (218, '00541', 'Язъяванский филиал АКБ \"Агробанк\"'),
                                                         (219, '00542', 'Сохский филиал АКБ \"Агробанк\"'),
                                                         (220, '00544', 'Ферганский областной филиал АКИБ \"Ипотека-банк\"'),
                                                         (221, '00545', 'Кокандский филиал Узнацбанка'),
                                                         (222, '00546', 'Кокандский филиал АКБ \"Агробанк\"'),
                                                         (223, '00548', 'Хорезмский областной территориальный филиал АКБ \"Агробанк\"'),
                                                         (224, '00554', 'Гурленский филиал АКБ \"Агробанк\"'),
                                                         (225, '00556', 'Багатский филиал АКБ \"Агробанк\"'),
                                                         (226, '00558', 'Хазараспский филиал АКБ \"Агробанк\"'),
                                                         (227, '00560', 'Ханкинский филиал АКБ \"Агробанк\"'),
                                                         (228, '00563', 'Янгиарыкский филиал АКБ \"Агробанк\"'),
                                                         (229, '00565', 'Кушкупырский филиал АКБ \"Агробанк\"'),
                                                         (230, '00567', 'Шаватский филиал АКБ \"Агробанк\"'),
                                                         (231, '00569', 'Ургенчский филиал АКБ \"Агробанк\"'),
                                                         (232, '00574', 'Янгибазарский филиал АКБ \"Агробанк\"'),
                                                         (233, '00579', 'Хорезмский областной филиал АКИБ \"Ипотека-банк\"'),
                                                         (234, '00580', 'Филиал \"Тинчлик\" АКИБ \"Ипотека-банк\"'),
                                                         (235, '00581', 'Ургенчский  филиал АО \"Асакабанк\"'),
                                                         (236, '00583', 'Территориальный филиал Республики Каракалпакстан АКБ \"Агробанк\"'),
                                                         (237, '00589', 'Кегейлийский филиал АКБ \"Агробанк\"'),
                                                         (238, '00590', 'Шуманайский филиал АКБ \"Агробанк\"'),
                                                         (239, '00592', 'Кунградский филиал АКБ \"Агробанк\"'),
                                                         (240, '00594', 'Муйнакский филиал АКБ \"Агробанк\"'),
                                                         (241, '00595', 'Нукусский филиал АКБ \"Агробанк\"'),
                                                         (242, '00597', 'Тахтакупырский филиал АКБ \"Агробанк\"'),
                                                         (243, '00598', 'Турткульский филиал АКБ \"Агробанк\"'),
                                                         (244, '00602', 'Ходжейлийский филиал АКБ \"Агробанк\"'),
                                                         (245, '00605', 'Чимбайский филиал АКБ \"Агробанк\"'),
                                                         (246, '00607', 'Берунийский филиал АКБ \"Агробанк\"'),
                                                         (247, '00609', 'Канлыкульский филиал АКБ \"Агробанк\"'),
                                                         (248, '00612', 'Караузакский филиал АКБ \"Агробанк\"'),
                                                         (249, '00614', 'Элликкалинский филиал АКБ \"Агробанк\"'),
                                                         (250, '00619', 'Амударьинский филиал АКБ \"Агробанк\"'),
                                                         (251, '00621', 'Каракалпакстанский филиал АКИБ \"Ипотека-банк\"'),
                                                         (252, '00625', 'Нукусский филиал АО \"Асакабанк\"'),
                                                         (253, '00631', 'Кокандский филиал АО \"Асакабанк\"'),
                                                         (254, '00837', 'Юнусабадский филиал АКИБ \"Ипотека-банк\"'),
                                                         (255, '00842', 'Головной офис АО \"КДБ Банк Узбекистан\"'),
                                                         (256, '00865', 'Ургутский филиал Узнацбанка'),
                                                         (257, '00873', 'Головной офис АО \"Асакабанк\"'),
                                                         (258, '00877', 'Уйчинский филиал Узнацбанка'),
                                                         (259, '00881', 'Учкурганский филиал Узнацбанка'),
                                                         (260, '00885', 'Бешарыкский филиал Узнацбанка'),
                                                         (261, '00886', 'Кувинский филиал Узнацбанка'),
                                                         (262, '00892', 'Джизакский индустриальный филиал Узнацбанка'),
                                                         (263, '00893', 'Асакинский филиал Узнацбанка'),
                                                         (264, '00901', 'Алмазарский филиал АКИБ \"Ипотека-банк\"'),
                                                         (265, '00913', 'Джамбайский филиал Узнацбанка'),
                                                         (266, '00916', 'Мирзачульский филиал Узнацбанка'),
                                                         (267, '00929', 'Самаркандский филиал АКБ \"Агробанк\"'),
                                                         (268, '00932', 'Чартакский филиал Узнацбанка'),
                                                         (269, '00937', 'Головной офис АКИБ \"Ипотека-банк\"'),
                                                         (270, '00941', 'Пастдаргомский филиал Узнацбанка'),
                                                         (271, '00946', 'Риштанский филиал Узнацбанка'),
                                                         (272, '00950', 'ДБ Банка Садерат Ирана в городе г. Ташкенте Республики Узбекистан'),
                                                         (273, '00955', 'Мархаматский филиал Узнацбанка'),
                                                         (274, '00958', 'Сергелийский филиал АО \"Асакабанк\"'),
                                                         (275, '00959', 'Яшнободский филиал АКИБ \"Ипотека-банк\"'),
                                                         (276, '00963', 'Юнусабадский филиал АО \"Асакабанк\"'),
                                                         (277, '00969', 'Шайхантаурский филиал АО \"Асакабанк\"'),
                                                         (278, '00973', 'Головной офис АКБ \"Универсал банк\"'),
                                                         (279, '00974', 'Операционное управление АКБ \"Капиталбанк\"'),
                                                         (280, '00978', 'Сергелийский филиал АКИБ \"Ипотека-банк\"'),
                                                         (281, '00980', '\"OCTOBANK\" AO'),
                                                         (282, '00981', 'ОПЕРУ ЧАКБ \"Давр-банк\"'),
                                                         (283, '00997', 'Чиланзарский филиал АКИБ \"Ипотека-банк\"'),
                                                         (284, '00999', 'Урикзарский филиал АИКБ \"Ипак Йули\"'),
                                                         (285, '01017', 'Яккасарайский филиал АКИБ \"Ипотека-банк\"'),
                                                         (286, '01018', 'Мирзо-Улугбекский филиал АКБ \"Капиталбанк\"'),
                                                         (287, '01021', 'Зарафшанский филиал АО \"Асакабанк\"'),
                                                         (288, '01028', 'Яккасарайский филиал АИКБ \"Ипак Йули\"'),
                                                         (289, '01032', 'Термезский филиал АКБ \"Капиталбанк\"'),
                                                         (290, '01033', 'Филиал \"Чорсу\" АКБ \"Капиталбанк\"'),
                                                         (291, '01036', 'Филиал \"Сагбан\" АИКБ \"Ипак Йули\"'),
                                                         (292, '01037', 'АКБ \"Банк развития бизнеса\"'),
                                                         (293, '01038', 'Нукусский филиал АКБ \"Капиталбанк\"'),
                                                         (294, '01039', 'Чиназский филиал АКИБ \"Ипотека-банк\"'),
                                                         (295, '01041', 'Головной офис АО \"InFinBank\"'),
                                                         (296, '01042', 'Сергелийский филиал АКБ \"Капиталбанк\"'),
                                                         (297, '01043', 'Ферганский филиал АКБ \"Капиталбанк\"'),
                                                         (298, '01046', 'Чиланзарский филиал ЧАКБ \"Давр-банк\"'),
                                                         (299, '01048', 'Шахрисабзский филиал АИКБ \"Ипак Йули\"'),
                                                         (300, '01054', 'Наманганский филиал АИКБ \"Ипак Йули\"'),
                                                         (301, '01056', 'Ташкентский областной филиал АО \"InFinBank\"'),
                                                         (302, '01061', 'Самаркандский филиал АКБ \"Капиталбанк\"'),
                                                         (303, '01065', 'Филиал Ойбек АО \"КДБ Банк Узбекистан\"'),
                                                         (304, '01067', 'Чиланзарский филиал АИКБ \"Ипак Йули\"'),
                                                         (305, '01069', 'Яккасарайский филиал ЧАКБ \"Давр-банк\"'),
                                                         (306, '01070', 'Сергелийский филиал АО \"InFinBank\"'),
                                                         (307, '01071', 'Головной офис ЧАКБ \"Ориент Финанс\"'),
                                                         (308, '01072', 'Мирзо Улугбекский филиал ЧАКБ \"Давр-банк\"'),
                                                         (309, '01076', 'Кокандский филиал АКИБ \"Ипотека-банк\"'),
                                                         (310, '01080', 'Зангиатинский филиал АО \"InFinBank\"'),
                                                         (311, '01081', 'Янгиюльский филиал АИКБ \"Ипак Йули\"'),
                                                         (312, '01082', 'Бухарский филиал АКБ \"Капиталбанк\"'),
                                                         (313, '01085', 'Наманганский филиал АКБ \"Капиталбанк\"'),
                                                         (314, '01086', 'Учтепинский филиал ЧАКБ \"Давр-банк\"'),
                                                         (315, '01087', 'Кокандский филиал АКБ \"Капиталбанк\"'),
                                                         (316, '01088', 'Головной офис \"Капиталбанк\"'),
                                                         (317, '01095', 'Головной офис АКБ \"ASIA ALLIANCE BANK\"'),
                                                         (318, '01101', 'Мирабадский филиал АИКБ \"Ипак Йули\"'),
                                                         (319, '01107', 'Бухарский областной филиал АО \"InFinBank\"'),
                                                         (320, '01112', 'Регистанский филиал Узнацбанка'),
                                                         (321, '01113', 'Наманганский областной филиал АО \"InFinBank\"'),
                                                         (322, '01114', 'Андижанский областной филиал АО \"InFinBank\"'),
                                                         (323, '01116', 'Кокандский филиал АО \"InFinBank\"'),
                                                         (324, '01119', 'Каршинский филиал АИКБ \"Ипак Йули\"'),
                                                         (325, '01120', 'Андижанский филиал АИКБ \"Ипак Йули\"'),
                                                         (326, '01121', 'Алмазарский филиал ЧАКБ \"Давр-банк\"'),
                                                         (327, '01122', 'Юнусабадский филиал ЧАКБ \"Давр-банк\"'),
                                                         (328, '01125', 'Главное операционное управления АК \"Халкбанк\"'),
                                                         (329, '01128', 'Ферганский областной филиал АО \"InFinBank\"'),
                                                         (330, '01129', 'Хорезмский областной филиал АО \"InFinBank\"'),
                                                         (331, '01130', 'Зангиатинский филиал АКИБ \"Ипотека-банк\"'),
                                                         (332, '01133', 'Самаркандский областной филиал АО \"InFinBank\"'),
                                                         (333, '01135', 'Кашкадарьинский областной филиал АО \"InFinBank\"'),
                                                         (334, '01136', 'Яшнободский филиал АКБ \"Капиталбанк\"'),
                                                         (335, '01139', 'Каракалпакстанский филиал АО \"InFinBank\"'),
                                                         (336, '01140', 'Центральное операционное управления АКБ \"Агробанк\"'),
                                                         (337, '01142', 'АКБ \"Мадад Инвест Банк\" '),
                                                         (338, '01145', 'Шайхантахурский филиал АИКБ \"Ипак Йули\"'),
                                                         (339, '01148', 'Навоийский областной филиал АО \"InFinBank\"'),
                                                         (340, '01150', 'Акционерное общество \"AVO BANK\"'),
                                                         (341, '01158', 'Операционное управление АКБ \"Капиталбанк\"'),
                                                         (342, '01165', 'Учтепинский филиал АО \"InFinBank\"'),
                                                         (343, '01168', 'Ферганский филлиал АИКБ \"Ипак Йули\"'),
                                                         (344, '01170', 'Дустободский филиал Ипотека-банк'),
                                                         (345, '01172', 'Головной офис Пойтахт банка'),
                                                         (346, '01176', 'Головной офис АКБ \"Tenge Bank\" '),
                                                         (347, '01180', 'Головной офис АКБ \"Тибиси Банк\"'),
                                                         (348, '01183', 'Головной офис АО \"ANOR BANK\"'),
                                                         (349, '01184', 'Ташкентский цифровой филиал АКБ \"Капиталбанк\"'),
                                                         (350, '01186', 'Мирабадский цифровой филиал АКБ \"Универсал банк\"'),
                                                         (351, '01188', 'Бухарский филиал АИКБ \"Ипак Йули\"'),
                                                         (352, '01190', 'Акционерное общество \"UZUM BANK\"'),
                                                         (353, '01194', 'Филиал \"FRESH\" АКБ \"Агробанк\"'),
                                                         (354, '01196', 'Акционерное общество \"APEX BANK\"'),
                                                         (355, '01197', 'Акционерное общество \"YANGI BANK\"'),
                                                         (356, '01198', 'Акционерное общество \"HAYOT BANK\"'),
                                                         (357, '01199', 'Акционерное общество \"SMART BANK\"'),
                                                         (358, '01204', 'Акционерное общество \"Евразийский Банк\"'),
                                                         (359, '09001', 'Платежный центр центрального банка'),
                                                         (360, '09002', 'Расчетно-клиринговый центр Узнацбанка'),
                                                         (361, '09003', 'Платежный центр АКБ \"Узпромстройбанк\"'),
                                                         (362, '09004', 'Расчетный центр АКБ \"Агробанк\"'),
                                                         (363, '09005', 'Платежный центр АКБ \"Микрокредитбанк\"'),
                                                         (364, '09008', 'Платежный центр АО \"Гарант банк\"'),
                                                         (365, '09013', 'Платежный центр АО \"Асакабанк\"'),
                                                         (366, '09014', 'Расчетный центр АИКБ \"Ипак Йули\"'),
                                                         (367, '09020', 'Платежный центр АО \"Ziraat Bank Uzbekistan\"'),
                                                         (368, '09030', 'Платежный центр ЧАБ \"Трастбанк\"'),
                                                         (369, '09033', 'Платежный центр АКИБ \"Ипотека-банк\"'),
                                                         (370, '09034', 'Платежный центр АО \"КДБ Банк Узбекистан\"'),
                                                         (371, '09048', 'Платежный центр АКБ \"Универсал банк\"'),
                                                         (372, '09049', 'Расчетный центр АКБ \"Капиталбанк\"'),
                                                         (373, '09051', 'Платежный центр ЧАКБ \"Давр-банк\"'),
                                                         (374, '09053', 'Платежный центр АО \"InFinBank\"'),
                                                         (375, '09055', 'Платежный центр АКБ \"ASIA ALLIANCE BANK\"'),
                                                         (376, '09057', 'Платежный центр ЧАКБ \"Ориент Финанс\"');

-- --------------------------------------------------------

--
-- Структура таблицы `bank_accounts`
--

CREATE TABLE `bank_accounts` (
                                 `ID` int UNSIGNED NOT NULL,
                                 `bank_account` tinytext CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL,
                                 `bank_name` text CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL,
                                 `bank_code` tinytext CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL,
                                 `organization_id` int UNSIGNED DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `bank_accounts`
--

INSERT INTO `bank_accounts` (`ID`, `bank_account`, `bank_name`, `bank_code`, `organization_id`) VALUES
                                                                                                    (1, '23404000900876644328', 'Расчетно-кассовый центр Центрального банка по г. Ташкенту', '00014', 1),
                                                                                                    (2, '23404000700876644297', 'Расчетно-кассовый центр Центрального банка по г. Ташкенту', '00014', 1),
                                                                                                    (3, '23404000000876644303', 'Расчетно-кассовый центр Центрального банка по г. Ташкенту', '00014', 1),
                                                                                                    (4, '21506000900876644002', 'Расчетно-кассовый центр Центрального банка по г. Ташкенту', '00014', 1),
                                                                                                    (5, '21506000900876056002', 'Расчетно-кассовый центр Центрального банка по г. Ташкенту', '00014', 1),
                                                                                                    (6, '21506000700876644001', 'Расчетно-кассовый центр Центрального банка по г. Ташкенту', '00014', 1),
                                                                                                    (7, '23404000500876056328', 'Расчетно-кассовый центр Центрального банка по г. Ташкенту', '00014', 2),
                                                                                                    (8, '21506000900876056001', 'Расчетно-кассовый центр Центрального банка по г. Ташкенту', '00014', 2);

-- --------------------------------------------------------

--
-- Структура таблицы `chart_of_accounts`
--

CREATE TABLE `chart_of_accounts` (
                                     `id` int UNSIGNED NOT NULL,
                                     `number` int DEFAULT NULL,
                                     `name` varchar(262) CHARACTER SET utf8mb3 COLLATE utf8mb3_general_ci DEFAULT NULL,
                                     `debit` decimal(20,2) UNSIGNED DEFAULT '0.00',
                                     `credit` decimal(20,2) UNSIGNED DEFAULT '0.00'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `chart_of_accounts`
--

INSERT INTO `chart_of_accounts` (`id`, `number`, `name`, `debit`, `credit`) VALUES
                                                                                (1, 100000, 'Joriy aktivlar', 0.00, 0.00),
                                                                                (2, 101000, 'Hisob-kitoblar markazidagi pul mablag‘lari', 0.00, 0.00),
                                                                                (3, 109100, 'Milliy valyutadagi naqd pul mablag‘lari', 0.00, 0.00),
                                                                                (4, 215130, 'Respublika budjetidan rezident yuridik shaxslarga berilgan uzoq muddatli budjet ssudalari', 0.00, 0.00),
                                                                                (5, 101100, 'Yagona g‘azna hisobvarag‘ining milliy valyutadagi pul mablag‘lari', 0.00, 0.00),
                                                                                (6, 101110, 'Yagona g‘azna hisobvarag‘idagi budjet tizimi budjetlarining va boshqa budjetdan tashqari jamg‘armalarning milliy valyutadagi mablag‘lari', 0.00, 0.00),
                                                                                (7, 101190, 'Yagona g‘azna hisobvarag‘idagi milliy valyutadagi aniqlanmagan tushumlar', 0.00, 0.00),
                                                                                (8, 101200, 'Yagona g‘azna hisobvarag‘ining xorijiy valyutadagi pul mablag‘lari', 0.00, 0.00),
                                                                                (9, 101210, 'Yagona g‘azna hisobvarag‘idagi budjet tizimi budjetlarining va boshqa budjetdan tashqari jamg‘armalarining xorijiy valyutadagi mablag‘lari', 0.00, 0.00),
                                                                                (10, 109200, 'Xorijiy valyutadagi naqd pul mablag‘lari', 0.00, 0.00),
                                                                                (11, 101290, 'Yagona g‘azna hisobvarag‘idagi xorijiy valyutadagi aniqlanmagan tushumlar', 0.00, 0.00),
                                                                                (12, 102000, 'Budjet tizimi budjetlarining va boshqa budjetdan tashqari jamg‘armalarning mablag‘lari', 0.00, 0.00),
                                                                                (13, 102100, 'Davlat budjetining mablag‘lari', 0.00, 0.00),
                                                                                (14, 102110, 'O‘zbekiston Respublikasi respublika budjetining mablag‘lari', 0.00, 0.00),
                                                                                (15, 215140, 'Davlat budjeti mablag‘lari hisobidan maqsadli va boshqa budjetdan tashqari jamg‘armalarga berilgan uzoq muddatli ssudalar', 0.00, 0.00),
                                                                                (16, 102120, 'Qoraqalpog‘iston Respublikasi budjeti, viloyatlar va Toshkent shahar mahalliy budjetlarining mablag‘lari', 0.00, 0.00),
                                                                                (17, 102120, 'Qoraqalpog‘iston Respublikasining respublika budjeti, viloyatlarning viloyat budjeti va Toshkent shahrining shahar budjetining mablag‘lari', 0.00, 0.00),
                                                                                (18, 102122, 'Tumanlar va shaharlar budjetlarining mablag‘lari', 0.00, 0.00),
                                                                                (19, 102200, 'Davlat maqsadli jamg‘armalarining mablag‘lari', 0.00, 0.00),
                                                                                (20, 102300, 'Boshqa budjetdan tashqari jamg‘armalarning mablag‘lari', 0.00, 0.00),
                                                                                (21, 102400, 'Budjet tashkilotlarining budjetdan tashqari mablag‘lari', 0.00, 0.00),
                                                                                (22, 102401, 'Budjet tashkilotlarining rivojlantirish jamg‘armasi', 0.00, 0.00),
                                                                                (23, 102402, 'Tibbiyot tashkilotlarining moddiy rag‘batlantirish va rivojlantirish jamg‘armasi', 0.00, 0.00),
                                                                                (24, 102403, 'Budjetdan tashqari pensiya jamg‘armasi mablag‘laridan pensiya, nafaqa va boshqa to‘lovlar', 0.00, 0.00),
                                                                                (25, 110000, 'Boshqa pul mablag‘lari', 0.00, 0.00),
                                                                                (26, 102404, 'Budjet tashkilotlarining budjetga o‘tkazilishi lozim bo‘lgan (o‘tgan yilning debitor qarzdorligini, kamomadlarni, tekshiruv natijasiga ko‘ra aniqlangan o‘zlashtirishlarni) mablag‘lari', 0.00, 0.00),
                                                                                (27, 111000, 'Yo‘ldagi pul mablag‘lari', 0.00, 0.00),
                                                                                (28, 111100, 'Budjet hisobidan naqd pul olish uchun tranzit hisobvaraqlariga o‘tkazilgan mablag‘lar', 0.00, 0.00),
                                                                                (29, 111200, 'Davlat maqsadli va boshqa budjetdan tashqari jamg‘armalari hisobidan naqd pul olish uchun tranzit hisobvaraqlariga o‘tkazilgan mablag‘lar', 0.00, 0.00),
                                                                                (30, 111300, 'Budjet tashkilotlarining budjetdan tashqari mablag‘lari hisobidan naqd pul olish uchun tranzit hisobvaraqlariga o‘tkazilgan mablag`lar', 0.00, 0.00),
                                                                                (31, 111301, 'Budjet tashkilotlarini rivojlantirish jamg‘armasi mablag‘lari hisobidan naqd pul olish uchun tranzit hisobvaraqlarga o‘tkazilgan mablag‘lar', 0.00, 0.00),
                                                                                (32, 215200, 'Davlat maqsadli jamg‘armalaridan maqsadli va boshqa budjetdan tashqari jamg‘armalarga berilgan uzoq muddatli ssudalar', 0.00, 0.00),
                                                                                (33, 216000, 'Budjet tashkilotlari tomonidan xodimlarga berilgan ssudalar', 0.00, 0.00),
                                                                                (34, 220000, 'Nomoliyaviy aktivlar', 0.00, 0.00),
                                                                                (35, 111302, 'Budjet tashkilotlarining O‘zbekiston Respublikasi Iqtisodiyot va moliya vazirligi huzuridagi Budjetdan tashqari pensiya jamg‘armasi mablag‘lari hisobidan naqd pul olish uchun tranzit hisobvaraqlariga o‘tkazilgan mablag‘lar', 0.00, 0.00),
                                                                                (36, 221000, 'Asosiy vositalar', 0.00, 0.00),
                                                                                (37, 324100, 'O‘zbekiston Respublikasining respublika budjetidan ajratiladigan transfertlar bo‘yicha kreditor qarzlar', 0.00, 0.00),
                                                                                (38, 221100, 'Bino va inshootlar', 0.00, 0.00),
                                                                                (39, 111303, 'Tibbiyot muassasalarini moddiy rag‘batlantirish va rivojlantirish jamg‘armasi mablag‘lari hisobidan naqd pul olish uchun tranzit hisobvaraqlariga o‘tkazilgan mablag‘lar', 0.00, 0.00),
                                                                                (40, 324200, 'Qoraqalpog‘iston Respublikasi respublika budjeti, viloyatlar viloyat budjetlari va Toshkent shahri shahar budjetining ajratiladigan transfertlar bo‘yicha kreditor qarzlari', 0.00, 0.00),
                                                                                (41, 111306, 'Maktabdan tashqari ta’lim muassasalarida bolalar ta’minoti mablag‘lari hisobidan naqd pul olish uchun tranzit hisobvaraqlariga o‘tkazilgan mablag‘lar', 0.00, 0.00),
                                                                                (42, 221110, 'Turarjoy binolari', 0.00, 0.00),
                                                                                (43, 111309, 'O‘quv muassasalarida o‘qishdan tushayotgan pul mablag‘lari hisobidan naqd pul olish uchun tranzit hisobvaraqlariga o‘tkazilgan mablag‘lar', 0.00, 0.00),
                                                                                (44, 111310, 'Ajratmalar hisobiga shakllanadigan vazirlik va idoralarning budjetdan tashqari jamg‘armalari hisobidan naqd pul olish uchun tranzit hisobvaraqlariga o‘tkazilgan mablag‘lar', 0.00, 0.00),
                                                                                (45, 221120, 'Noturarjoy binolari', 0.00, 0.00),
                                                                                (46, 111314, 'Taqsimlanishi nazarda tutilgan tushumlar (tibbiyot muassasalari uchun) hisobidan naqd pul olish uchun tranzit hisobvaraqlariga o‘tkazilgan mablag‘lar', 0.00, 0.00),
                                                                                (47, 221130, 'Boshqa inshootlar', 0.00, 0.00),
                                                                                (48, 111315, 'Boshqa ta’lim muassasalarida bolalar ta’minoti bo‘yicha ota-onalar to‘lovi hisobidan naqd pul olish uchun tranzit hisobvaraqlariga o‘tkazilgan mablag‘lar', 0.00, 0.00),
                                                                                (49, 111320, 'Grantlar, insonparvarlik yordami va texnik ko‘maklashish vositalari bo‘yicha ajratilgan mablag‘lar hisobidan naqd pul olish uchun tranzit hisobvaraqlariga o‘tkazilgan mablag‘lar', 0.00, 0.00),
                                                                                (50, 111321, 'Kredit mablag‘lari hisobidan naqd pul olish uchun tranzit hisobvaraqlariga o‘tkazilgan mablag‘lar', 0.00, 0.00),
                                                                                (51, 111400, 'Konvertatsiya uchun tranzit hisob raqamiga o‘tkazib berilgan mablag‘lar', 0.00, 0.00),
                                                                                (52, 111500, 'Hisob-kitob kliring palatasiga o‘tkazilgan mablag‘lar', 0.00, 0.00),
                                                                                (53, 221140, 'Yerni obodonlashtirish', 0.00, 0.00),
                                                                                (54, 111900, 'Yo‘ldagi boshqa mablag‘lar', 0.00, 0.00),
                                                                                (55, 221200, 'Mashina va jihozlar', 0.00, 0.00),
                                                                                (56, 221210, 'Transport vositalari', 0.00, 0.00),
                                                                                (57, 221220, 'Mashina va jihozlar (transport vositalaridan tashqari)', 0.00, 0.00),
                                                                                (58, 221221, 'Informatsion, kompyuter va telekommunikatsion jihozlar', 0.00, 0.00),
                                                                                (59, 221222, 'Boshqa turdagi mashina va jihozlar', 0.00, 0.00),
                                                                                (60, 221300, 'Boshqa turdagi asosiy vositalar', 0.00, 0.00),
                                                                                (61, 221310, 'Etishtiriladigan biologik aktivlar', 0.00, 0.00),
                                                                                (62, 221311, 'Mahsuldor va ishchi hayvonlar ', 0.00, 0.00),
                                                                                (63, 221312, 'Ko‘p yillik daraxtlar va o‘simlik resurslari ', 0.00, 0.00),
                                                                                (64, 221320, 'Intellektual mulk obyektlari', 0.00, 0.00),
                                                                                (65, 330000, 'Budjet tizimi budjetlarining va boshqa budjetdan tashqari jamg‘armalarning xarajatlari bo‘yicha majburiyatlar', 0.00, 0.00),
                                                                                (66, 331000, 'Davlat budjetining xarajatlari majburiyatlari', 0.00, 0.00),
                                                                                (67, 331100, 'O‘zbekiston Respublikasi respublika budjetining xarajatlari majburiyatlari', 0.00, 0.00),
                                                                                (68, 331200, 'Qoraqalpog‘iston Respublikasi budjetining, viloyatlar va Toshkent shahar mahalliy budjetlarining xarajatlari majburiyatlari', 0.00, 0.00),
                                                                                (69, 331210, 'Qoraqalpog‘iston Respublikasining respublika budjeti, viloyatlarning viloyat budjeti va Toshkent shahrining shahar budjetining xarajatlari majburiyatlari', 0.00, 0.00),
                                                                                (70, 331220, 'Tumanlar va shaharlar budjetlarining xarajatlari majburiyatlari', 0.00, 0.00),
                                                                                (71, 332000, 'Budjet tashkilotlarining budjetdan tashqari mablag‘lari hisobidan xarajatlari majburiyatlari', 0.00, 0.00),
                                                                                (72, 333000, 'Davlat maqsadli va boshqa budjetdan tashqari jamg‘armalarning xarajatlari bo‘yicha majburiyatlar', 0.00, 0.00),
                                                                                (73, 334000, 'Iqtisodiyot va moliya vazirligi huzuridagi Bojxona qo‘mitasining g‘aznachilikda milliy valyutadagi depozit shaxsiy g‘azna hisobvarag‘i mablag‘lari hisobidan xarajatlari majburiyatlari', 0.00, 0.00),
                                                                                (74, 335000, 'Budjet tashkilotlarining Iqtisodiyot va moliya vazirligi huzuridagi budjetdan tashqari pensiya jamg‘armasining ijtimoiy nafaqalarni to‘lash uchun mablag‘lari hisobidan xarajatlari majburiyatlari', 0.00, 0.00),
                                                                                (75, 336000, 'Budjet tashkilotlari va budjet mablag‘larini oluvchilarning budjetga o‘tkazilishi lozim bo‘lgan (o‘tgan yilning debitor qarzdorligini, kamomadlarni, tekshiruv natijasiga ko‘ra aniqlangan o‘zlashtirishlarni) mablag‘lari bo‘yicha xarajatlari majburiyatlari', 0.00, 0.00),
                                                                                (76, 337000, 'Davlat budjeti mablag‘lari hisobidan budjet tashkilotlarining budjetdan tashqari mablag‘lariga yo‘naltirilgan xarajatlar', 0.00, 0.00),
                                                                                (77, 338000, 'Davlat budjeti mablag‘lari hisobidan budjetdan mablag‘ oluvchilarga va budjet tashkilotlarining boshqa hisobraqamlariga moliyalashtirish', 0.00, 0.00),
                                                                                (78, 340000, 'Budjet tashkilotlarining kreditor qarzlari', 0.00, 0.00),
                                                                                (79, 341000, 'Budjet tashkilotlarining turli hisob-kitoblari bo‘yicha kreditor qarzlari', 0.00, 0.00),
                                                                                (80, 341100, 'Budjet tashkilotlarining mahsulot yetkazib beruvchilar va pudratchilar bilan hisob-kitoblar bo‘yicha kreditor qarzlari', 0.00, 0.00),
                                                                                (81, 102405, 'Maktabgacha ta’lim tashkilotlarida bolalar ta’minoti uchun ota-onalardan olinadigan to‘lovlar', 0.00, 0.00),
                                                                                (82, 341200, 'Budjet tashkilotlarining xaridor va buyurtmachilar bilan hisob-kitoblar bo‘yicha kreditor qarzlari', 0.00, 0.00),
                                                                                (83, 102406, 'Maktabdan tashqari muassasalarda bolalar ta’minoti uchun ota-onalardan olinadigan to‘lovlar', 0.00, 0.00),
                                                                                (84, 102407, 'Ish joyida ovqat bilan ta’minlanganligi uchun xodimlar bilan hisob-kitoblardan tushumlar', 0.00, 0.00),
                                                                                (85, 102408, 'Maktab-internatlar va litseylarda bolalarning ta’minoti uchun ota-onalardan tushumlar', 0.00, 0.00),
                                                                                (86, 102409, 'Ta’lim muassasalarida o‘qitishning to‘lov-kontrakt shaklidan tushumlar', 0.00, 0.00),
                                                                                (87, 102410, 'Vazirliklar va idoralarning ajratmalar hisobiga shakllanadigan budjetdan tashqari jamg‘armalari', 0.00, 0.00),
                                                                                (88, 102411, 'Umumta’lim muassasalarida darsliklar ijarasi to‘lovi', 0.00, 0.00),
                                                                                (89, 102412, 'Kapital qo‘yilmalar bo‘yicha depozitlar', 0.00, 0.00),
                                                                                (90, 102413, 'Turg‘un davolash-profilaktika muassasalarida davolanayotgan bemorlardan ovqatlanish uchun undiriladigan to‘lovlar', 0.00, 0.00),
                                                                                (91, 102414, 'Taqsimlanadigan mablag‘lar', 0.00, 0.00),
                                                                                (92, 102415, 'Boshqa ta’lim muassasalarida bolalar ta’minoti uchun ota-onalardan olinadigan to‘lovlar', 0.00, 0.00),
                                                                                (93, 102416, 'Boshqa depozitlar', 0.00, 0.00),
                                                                                (94, 102417, 'Bojxona to‘lovlarini to‘lashdan tushgan tushumlar', 0.00, 0.00),
                                                                                (95, 102418, 'Grantlar, insonparvarlik yordami va texnik ko‘maklashish vositalari bo‘yicha ajratilgan mablag‘lar', 0.00, 0.00),
                                                                                (96, 102419, 'Kreditlar', 0.00, 0.00),
                                                                                (97, 102900, 'Yagona g‘azna hisobvarag‘idagi aniqlanmagan tushumlar', 0.00, 0.00),
                                                                                (98, 102901, 'Yagona g‘azna hisobvarag‘idagi budjet mablag‘lari bo‘yicha aniqlanmagan tushumlar', 0.00, 0.00),
                                                                                (99, 102902, 'Yagona g‘azna hisobvarag‘idagi davlat maqsadli jamg‘armalari va boshqa budjetdan tashqari jamg‘armalar bo‘yicha aniqlanmagan tushumlar', 0.00, 0.00),
                                                                                (100, 103000, 'Davlat budjeti, davlat maqsadli va boshqa budjetdan tashqari jamg‘armalarining boshqa hisobraqamlardagi mablag‘lari', 0.00, 0.00),
                                                                                (101, 103100, 'Davlat budjetining boshqa hisobraqamlardagi mablag‘lari', 0.00, 0.00),
                                                                                (102, 103200, 'Davlat maqsadli va boshqa budjetdan tashqari jamg‘armalarining boshqa hisobraqamlardagi mablag‘lari', 0.00, 0.00),
                                                                                (103, 104000, 'Budjet tashkilotlarining boshqa hisobraqamlardagi mablag‘lari', 0.00, 0.00),
                                                                                (104, 104100, 'Budjet tashkilotlarining boshqa hisobraqamlardagi budjet bo‘yicha mablag‘lari', 0.00, 0.00),
                                                                                (105, 104110, 'Tashkilotni saqlash uchun moliyalashtirilgan budjet mablag‘lari', 0.00, 0.00),
                                                                                (106, 104120, 'Boshqa maqsadlar uchun moliyalashtirilgan budjet mablag‘lari', 0.00, 0.00),
                                                                                (107, 104400, 'Budjet tashkilotlarining boshqa hisobraqamlardagi budjetdan tashqari mablag‘lari', 0.00, 0.00),
                                                                                (108, 104410, 'To‘lovlarning maxsus turlariga doir hisob-kitoblardan tushgan mablag‘lar', 0.00, 0.00),
                                                                                (109, 104420, 'Ta’lim muassasalarida o‘qitishning to‘lov-kontrakt shaklidan tushumlar', 0.00, 0.00),
                                                                                (110, 104430, 'Budjet tashkilotining rivojlantirish jamg‘armasi mablag‘lari', 0.00, 0.00),
                                                                                (111, 104440, 'Boshqa budjetdan tashqari mablag‘lar', 0.00, 0.00),
                                                                                (112, 104450, 'Budjet tashkilotlarining vaqtincha ixtiyorida bo‘ladigan mablag‘lar', 0.00, 0.00),
                                                                                (113, 104460, 'Budjetdan tashqari pensiya jamg‘armasi mablag‘laridan pensiya, nafaqa va boshqa to‘lovlar', 0.00, 0.00),
                                                                                (114, 104470, 'Taqsimlanadigan mablag‘lar', 0.00, 0.00),
                                                                                (115, 105000, 'Budjet tizimi budjetlarining va boshqa budjetdan tashqari jamg‘armalarning xorijiy valyutadagi mablag‘lari', 0.00, 0.00),
                                                                                (116, 105100, 'Davlat budjetining xorijiy valyutadagi mablag‘lari', 0.00, 0.00),
                                                                                (117, 105200, 'Davlat maqsadli jamg‘armalarining va boshqa budjetdan tashqari jamg‘armalarning xorijiy valyutadagi mablag‘lari', 0.00, 0.00),
                                                                                (118, 105300, 'Budjet tashkilotlarining xorijiy valyutadagi budjetdan tashqari mablag‘lari', 0.00, 0.00),
                                                                                (119, 106000, 'Davlat budjeti, davlat maqsadli va boshqa budjetdan tashqari jamg‘armalarning boshqa hisobraqamlardagi xorijiy valyutadagi mablag‘lari', 0.00, 0.00),
                                                                                (120, 106100, 'Davlat budjetining boshqa hisobraqamlardagi xorijiy valyutadagi mablag‘lari', 0.00, 0.00),
                                                                                (121, 106200, 'Davlat maqsadli va boshqa budjetdan tashqari jamg‘armalarning boshqa hisobraqamlardagi xorijiy valyutadagi mablag‘lari', 0.00, 0.00),
                                                                                (122, 107000, 'Budjet tashkilotlarining boshqa hisobraqamlardagi xorijiy valyutadagi mablag‘lari', 0.00, 0.00),
                                                                                (123, 108000, 'Hisob-kitob kliring palatasining mablag‘lari', 0.00, 0.00),
                                                                                (124, 109000, 'Naqd pul mablag‘lari', 0.00, 0.00),
                                                                                (125, 341300, 'Budjet tashkilotlarining sug‘urta to‘lovlari bo‘yicha hisob-kitoblardan kreditor qarzlari', 0.00, 0.00),
                                                                                (126, 341400, 'Budjet tashkilotlarining to‘lovlarning maxsus turlariga doir hisob-kitoblardan kreditor qarzlari', 0.00, 0.00),
                                                                                (127, 341900, 'Budjet tashkilotlarining boshqa turdagi hisob-kitoblardan kreditor qarzlari', 0.00, 0.00),
                                                                                (128, 342000, 'Budjet tashkilotlarining budjet va budjetdan tashqari jamg‘armalardan kreditor qarzlari', 0.00, 0.00),
                                                                                (129, 342100, 'Budjet tashkilotlarining budjetga to‘lovlar bo‘yicha kreditor qarzlari', 0.00, 0.00),
                                                                                (130, 342200, 'Budjet tashkilotlarining ijtimoiy soliq bo‘yicha kreditor qarzlari', 0.00, 0.00),
                                                                                (131, 342300, 'Budjet tashkilotlarining shaxsiy jamg‘arib boriladigan Pensiya hisobvarag‘i badallari bo‘yicha kreditor qarzlari', 0.00, 0.00),
                                                                                (132, 342400, 'Budjet tashkilotlarining budjetdan tashqari pensiya jamg‘armasi bilan sug‘urta badali to‘lovi bo‘yicha kreditor qarzlari', 0.00, 0.00),
                                                                                (133, 342500, 'Budjet tashkilotlarining davlat maqsadli jamg‘armalariga majburiy to‘lovlari bo‘yicha kreditor qarzlari', 0.00, 0.00),
                                                                                (134, 221321, 'Tadqiqot va ishlanmalar', 0.00, 0.00),
                                                                                (135, 343000, 'Budjet tashkilotlarining xodimlar va stipendiya oluvchilar bilan kreditor qarzlari', 0.00, 0.00),
                                                                                (136, 221322, 'Foydali qazilmalarni qazib olish', 0.00, 0.00),
                                                                                (137, 221323, 'Kompyuter dasturiy ta’minoti', 0.00, 0.00),
                                                                                (138, 343100, 'Budjet tashkilotlarining kamomadlarga doir kreditor qarzlari', 0.00, 0.00),
                                                                                (139, 343200, 'Budjet tashkilotlarining xodimlar bilan ijtimoiy nafaqalar bo‘yicha kreditor qarzlari', 0.00, 0.00),
                                                                                (140, 221324, 'Ma’lumotlar bazasi', 0.00, 0.00),
                                                                                (141, 221325, 'Ko‘ngilochar, badiiy va ijodiy qiymatliklar', 0.00, 0.00),
                                                                                (142, 112000, 'Akkreditivlar', 0.00, 0.00),
                                                                                (143, 221326, 'Boshqa turdagi intellektual mulk obyektlari', 0.00, 0.00),
                                                                                (144, 343300, 'Budjet tashkilotlarining hisobdor shaxslar bilan kreditor qarzlari', 0.00, 0.00),
                                                                                (145, 221330, 'Kutubxona fondi', 0.00, 0.00),
                                                                                (146, 343400, 'Budjet tashkilotlarining xodimlar bilan mehnatga haq to‘lash bo‘yicha kreditor qarzlari', 0.00, 0.00),
                                                                                (147, 221331, 'Darsliklar fondi', 0.00, 0.00),
                                                                                (148, 343500, 'Budjet tashkilotlarining stipendiya oluvchilar bilan kreditor qarzlari', 0.00, 0.00),
                                                                                (149, 221332, 'Badiiy kitoblar fondi', 0.00, 0.00),
                                                                                (150, 113000, 'Pul ekvivalentlari', 0.00, 0.00),
                                                                                (151, 343600, 'Budjet tashkilotlarining talabalar bilan boshqa kreditor qarzlari', 0.00, 0.00),
                                                                                (152, 221339, 'Boshqa turdagi kutubxona fondi', 0.00, 0.00),
                                                                                (153, 120000, 'Moliyaviy mablag‘lar bo‘yicha joriy debitor qarzlar', 0.00, 0.00),
                                                                                (154, 343700, 'Budjet tashkilotlarining xodimlarning ish haqidan ushlab qolinadigan majburiy ushlanmalar bo‘yicha kreditor qarzlari', 0.00, 0.00),
                                                                                (155, 121000, 'Qisqa muddatli depozitlar', 0.00, 0.00),
                                                                                (156, 343800, 'Budjet tashkilotlarining deponentlangan to‘lovlar bo‘yicha kreditor qarzlari', 0.00, 0.00),
                                                                                (157, 343900, 'Budjet tashkilotlarining xodimlarning ish haqidan ushlab qolinadigan ixtiyoriy ushlanmalar bo‘yicha kreditor qarzlari', 0.00, 0.00),
                                                                                (158, 121100, 'Qisqa muddatli ichki depozitlar', 0.00, 0.00),
                                                                                (159, 221400, 'Harbiy asosiy vositalar', 0.00, 0.00),
                                                                                (160, 344000, 'Budjet tashkilotlarining budjetdan tashqari mablag‘lari hisobidan kreditor qarzlari', 0.00, 0.00),
                                                                                (161, 121200, 'Qisqa muddatli tashqi depozitlar', 0.00, 0.00),
                                                                                (162, 222000, 'Qiymatliklar', 0.00, 0.00),
                                                                                (163, 345000, 'Budjet tashkilotining ixtiyorida vaqtincha bo‘ladigan mablag‘lar bo‘yicha kreditor qarzlari', 0.00, 0.00),
                                                                                (164, 122000, 'Berilgan qisqa muddatli kreditlar', 0.00, 0.00),
                                                                                (165, 223000, 'Noishlab chiqarish aktivlari', 0.00, 0.00),
                                                                                (166, 122100, 'Berilgan qisqa muddatli ichki kreditlar', 0.00, 0.00),
                                                                                (167, 223100, 'Yer', 0.00, 0.00),
                                                                                (168, 122110, 'Nomoliyaviy davlat tashkilotlariga berilgan qisqa muddatli ichki kreditlar', 0.00, 0.00),
                                                                                (169, 223200, 'Mineral va energiya resurslari', 0.00, 0.00),
                                                                                (170, 122120, 'Nodavlat notijorat tashkilotlarga berilgan qisqa muddatli ichki kreditlar', 0.00, 0.00),
                                                                                (171, 740000, 'Budjet tashkilotining rivojlantirish jamg‘armasi hamda Tibbiyot tashkilotlarining moddiy rag‘batlantirish va rivojlantirish jamg‘armasi mablag‘lari hisobidan amalga oshirilgan haqiqiy xarajatlar', 0.00, 0.00),
                                                                                (172, 410000, 'Moliyaviy mablag‘lar bo‘yicha uzoq muddatli kreditor qarzlari', 0.00, 0.00),
                                                                                (173, 122130, 'Moliyaviy tashkilotlarga berilgan qisqa muddatli ichki kreditlar', 0.00, 0.00),
                                                                                (174, 741000, 'Budjet tashkilotlarining rivojlantirish jamg‘armasi mablag‘lari hisobidan amalga oshirilgan haqiqiy xarajatlar', 0.00, 0.00),
                                                                                (175, 411000, 'Olingan o‘rta va uzoq muddatli kreditlar', 0.00, 0.00),
                                                                                (176, 742000, 'Tibbiyot tashkilotlarining moddiy rag‘batlantirish va rivojlantirish jamg‘armasi mablag‘lari hisobidan amalga oshirilgan haqiqiy xarajatlar', 0.00, 0.00),
                                                                                (177, 750000, 'Boshqa daromadlar bo‘yicha haqiqiy xarajatlar', 0.00, 0.00),
                                                                                (178, 223300, 'Boshqa turdagi tabiiy aktivlar', 0.00, 0.00),
                                                                                (179, 800000, 'Hisoblangan xarajatlar (moliyaviy majburiyat)', 0.00, 0.00),
                                                                                (180, 223310, 'Nomahsuldor biologik aktivlar', 0.00, 0.00),
                                                                                (181, 810000, 'Davlat budjetining mablag‘lari hisobidan hisoblangan xarajatlar', 0.00, 0.00),
                                                                                (182, 820000, 'Budjet tashkilotlarining budjetdan tashqari mablag‘lari hisobidan hisoblangan xarajatlari', 0.00, 0.00),
                                                                                (183, 223320, 'Suv resurslari', 0.00, 0.00),
                                                                                (184, 830000, 'Davlat maqsadli va boshqa budjetdan tashqari jamg‘armalarning mablag‘lari hisobidan hisoblangan xarajatlari', 0.00, 0.00),
                                                                                (185, 122190, 'Boshqa berilgan qisqa muddatli ichki kreditlar', 0.00, 0.00),
                                                                                (186, 411100, 'Olingan o‘rta va uzoq muddatli ichki kreditlar', 0.00, 0.00),
                                                                                (187, 223330, 'Boshqa turdagi tabiiy resurslar', 0.00, 0.00),
                                                                                (188, 411110, 'Nomoliyaviy davlat tashkilotlaridan olingan o‘rta va uzoq muddatli ichki kreditlar', 0.00, 0.00),
                                                                                (189, 223331, 'Radiochastota spektri', 0.00, 0.00),
                                                                                (190, 411120, 'Nodavlat notijorat tashkilotlardan olingan o‘rta va uzoq muddatli ichki kreditlar', 0.00, 0.00),
                                                                                (191, 223332, 'Boshqa tabiiy resurslar', 0.00, 0.00),
                                                                                (192, 411130, 'Moliyaviy tashkilotlaridan olingan o‘rta va uzoq muddatli ichki kreditlar', 0.00, 0.00),
                                                                                (193, 411190, 'Boshqa olingan o‘rta va uzoq muddatli ichki kreditlar', 0.00, 0.00),
                                                                                (194, 411200, 'Olingan o‘rta va uzoq muddatli tashqi kreditlar', 0.00, 0.00),
                                                                                (195, 411210, 'Xorijiy hukumatlardan olingan o‘rta va uzoq muddatli tashqi kreditlar', 0.00, 0.00),
                                                                                (196, 411220, 'Xalqaro tashkilotlardan olingan o‘rta va uzoq muddatli tashqi kreditlar', 0.00, 0.00),
                                                                                (197, 223400, 'Nomoddiy noishlab chiqarish aktivlari', 0.00, 0.00),
                                                                                (198, 411230, 'Moliyaviy tashkilotlardan (xalqaro tashkilotlar bundan mustasno) olingan o‘rta va uzoq muddatli tashqi kreditlar', 0.00, 0.00),
                                                                                (199, 223410, 'Shartnoma, lizing va litsenziyalar', 0.00, 0.00),
                                                                                (200, 223411, 'Tijoriy operativ lizing', 0.00, 0.00),
                                                                                (201, 223412, 'Tabiiy resurslardan foydalanishga ruxsatnoma', 0.00, 0.00),
                                                                                (202, 412000, 'Chiqarilgan o‘rta va uzoq muddatli qimmatli qog‘ozlar (aksiya bundan mustasno)', 0.00, 0.00),
                                                                                (203, 223413, 'Ma’lum turdagi faoliyatni amalga oshirish uchun ruxsatnoma', 0.00, 0.00),
                                                                                (204, 122200, 'Berilgan qisqa muddatli tashqi kreditlar', 0.00, 0.00),
                                                                                (205, 223414, 'Kelgusi tovar va xizmatlarga imtiyozli egalik qilishga ruxsatnoma', 0.00, 0.00),
                                                                                (206, 223420, 'Gudvill va marketing aktivlari', 0.00, 0.00),
                                                                                (207, 123000, 'Olingan qisqa muddatli qimmatli qog‘ozlar (aksiyalar bundan mustasno)', 0.00, 0.00),
                                                                                (208, 412100, 'Chiqarilgan o‘rta va uzoq muddatli ichki qimmatli qog‘ozlar (aksiya bundan mustasno)', 0.00, 0.00),
                                                                                (209, 840000, 'Bojxona to‘lovlarini to‘lashdan tushgan depozit mablag‘lar hisobidan hisoblangan xarajatlar', 0.00, 0.00),
                                                                                (210, 123100, 'Olingan qisqa muddatli ichki qimmatli qog‘ozlar (aksiyalar bundan mustasno)', 0.00, 0.00),
                                                                                (211, 850000, 'Budjet tashkilotlarining Iqtisodiyot va moliya vazirligi huzuridagi budjetdan tashqari pensiya jamg‘armasi tomonidan ijtimoiy nafaqalarni to‘lash uchun o‘tkazib bergan pul mablag‘lari bo‘yicha hisoblangan xarajatlari', 0.00, 0.00),
                                                                                (212, 860000, 'Budjet tashkilotlari va budjet mablag‘larini oluvchilarning budjetga o‘tkazilishi lozim bo‘lgan (o‘tgan yilning debitor qarzdorligini, kamomadlarni, tekshiruv natijasiga ko‘ra aniqlangan o‘zlashtirishlarni) mablag‘lari hisobidan hisoblangan xarajatlari', 0.00, 0.00),
                                                                                (213, 900000, 'Kapital va moliyaviy natijalar', 0.00, 0.00),
                                                                                (214, 123200, 'Olingan qisqa muddatli tashqi qimmatli qog‘ozlar (aksiyalar bundan mustasno)', 0.00, 0.00),
                                                                                (215, 230000, 'Nomoliyaviy aktivlar amortizatsiyasi', 0.00, 0.00),
                                                                                (216, 901000, 'Markazlashgan holda olingan yoki berilgan moddiy qiymatliklar', 0.00, 0.00),
                                                                                (217, 130000, 'Budjetlararo munosabatlar bo‘yicha debitor qarzlar', 0.00, 0.00),
                                                                                (218, 231000, 'Asosiy vositalar amortizatsiyasi', 0.00, 0.00),
                                                                                (219, 131000, 'Berilgan qisqa muddatli ssudalar', 0.00, 0.00),
                                                                                (220, 231100, 'Bino va inshootlar amortizatsiyasi', 0.00, 0.00),
                                                                                (221, 131100, 'Budjet mablag‘laridan berilgan qisqa muddatli ssudalar', 0.00, 0.00),
                                                                                (222, 131110, 'Respublika budjetidan mahalliy budjetlarga berilgan qisqa muddatli budjet ssudalari', 0.00, 0.00),
                                                                                (223, 131120, 'Yuqori mahalliy budjetlardan quyi mahalliy budjetlarga berilgan qisqa muddatli budjet ssudalari', 0.00, 0.00),
                                                                                (224, 231110, 'Turarjoy binolari amortizatsiyasi', 0.00, 0.00),
                                                                                (225, 131130, 'Respublika budjetidan rezident yuridik shaxslarga berilgan qisqa muddatli budjet ssudalari', 0.00, 0.00),
                                                                                (226, 231120, 'Noturarjoy binolari amortizatsiyasi', 0.00, 0.00),
                                                                                (227, 231130, 'Boshqa inshootlar amortizatsiyasi', 0.00, 0.00),
                                                                                (228, 231140, 'Yerni obodonlashtirish amortizatsiyasi', 0.00, 0.00),
                                                                                (229, 412200, 'Chiqarilgan o‘rta va uzoq muddatli tashqi qimmatli qog‘ozlar (aksiya bundan mustasno)', 0.00, 0.00),
                                                                                (230, 231200, 'Mashina va jihozlar amortizatsiyasi', 0.00, 0.00),
                                                                                (231, 131140, 'Davlat budjeti mablag‘lari hisobidan davlat maqsadli va boshqa budjetdan tashqari jamg‘armalarga berilgan qisqa muddatli ssudalar', 0.00, 0.00),
                                                                                (232, 413000, 'Olingan uzoq muddatli ssudalar', 0.00, 0.00),
                                                                                (233, 231210, 'Transport vositalari amortizatsiyasi', 0.00, 0.00),
                                                                                (234, 413100, 'Budjet mablag‘laridan olingan uzoq muddatli ssudalar', 0.00, 0.00),
                                                                                (235, 231220, 'Mashina va jihozlar (transport vositalaridan tashqari) amortizatsiyasi', 0.00, 0.00),
                                                                                (236, 413110, 'O‘zbekiston Respublikasining respublika budjetidan mahalliy budjetlarga olingan uzoq muddatli budjet ssudalari', 0.00, 0.00),
                                                                                (237, 231221, 'Informatsion, kompyuter va telekommunikatsion jihozlar amortizatsiyasi', 0.00, 0.00),
                                                                                (238, 413120, 'Yuqori mahalliy budjetdan olingan uzoq muddatli budjet ssudalari', 0.00, 0.00),
                                                                                (239, 131200, 'Davlat maqsadli jamg‘armalaridan maqsadli va boshqa budjetdan tashqari jamg‘armalarga berilgan qisqa muddatli ssudalar', 0.00, 0.00),
                                                                                (240, 413130, 'Davlat maqsadli va boshqa budjetdan tashqari jamg‘armalariga budjet mablag‘lari hisobidan olingan uzoq muddatli ssudalar', 0.00, 0.00),
                                                                                (241, 132000, 'Budjetlar o‘rtasidagi o‘zaro hisob-kitoblar bo‘yicha debitor qarzlar', 0.00, 0.00),
                                                                                (242, 231222, 'Boshqa turdagi mashina va jihozlar amortizatsiyasi', 0.00, 0.00),
                                                                                (243, 413200, 'Davlat maqsadli va boshqa budjetdan tashqari jamg‘armalariga Davlat maqsadli jamg‘armalari hisobidan olingan uzoq muddatli ssudalar', 0.00, 0.00),
                                                                                (244, 132100, 'O‘zbekiston Respublika respublika budjeti bilan o‘zaro hisob-kitoblar bo‘yicha debitor qarzlar', 0.00, 0.00),
                                                                                (245, 420000, 'Budjet tashkilotlarining uzoq muddatli kreditor qarzlari', 0.00, 0.00),
                                                                                (246, 132200, 'Mahalliy budjetlar bilan o‘zaro hisob-kitoblar bo‘yicha debitor qarzlar', 0.00, 0.00),
                                                                                (247, 231300, 'Boshqa turdagi asosiy vositalar amortizatsiyasi', 0.00, 0.00),
                                                                                (248, 421000, 'Budjet tashkilotlarining turli hisob-kitoblari bo‘yicha uzoq muddatli kreditor qarzlari', 0.00, 0.00),
                                                                                (249, 132300, 'Davlat budjeti bajarilishi jarayonida yuzaga keladigan boshqa o‘zaro-hisob kitoblar bo‘yicha debitor qarzlar', 0.00, 0.00),
                                                                                (250, 231310, 'Etishtiriladigan biologik aktivlar amortizatsiyasi', 0.00, 0.00),
                                                                                (251, 133000, 'Davlat maqsadli va boshqa budjetdan tashqari jamg‘armalarning mablag‘laridan o‘zaro hisob-kitoblar bo‘yicha debitor qarzlar', 0.00, 0.00),
                                                                                (252, 133100, 'Davlat maqsadli va boshqa budjetdan tashqari jamg‘armalarning respublika mablag‘laridan o‘zaro hisob-kitoblar bo‘yicha debitor qarzlar', 0.00, 0.00),
                                                                                (253, 133200, 'Davlat maqsadli va boshqa budjetdan tashqari jamg‘armalarning Qoraqalpog‘iston Respublikasining respublika darajasidagi, viloyatlarning viloyat darajasidagi va Toshkent shahrining shahar darajasidagi mablag‘laridan o‘zaro hisob-kitoblar bo‘yicha debitor qarzlar', 0.00, 0.00),
                                                                                (254, 421100, 'Budjet tashkilotlarining mahsulot yetkazib beruvchilar va pudratchilar bilan hisob-kitoblar bo‘yicha uzoq muddatli kreditor qarzlari', 0.00, 0.00),
                                                                                (255, 231311, 'Ishchi hayvonlar amortizatsiyasi', 0.00, 0.00),
                                                                                (256, 133300, 'Davlat maqsadli va boshqa budjetdan tashqari jamg‘armalarning tumanlar va shaharlar darajasidagi mablag‘laridan o‘zaro hisob-kitoblar bo‘yicha debitor qarzlar', 0.00, 0.00),
                                                                                (257, 231312, 'Ko‘p yillik daraxtlar va o‘simlik resurslari amortizatsiyasi', 0.00, 0.00),
                                                                                (258, 231320, 'Intellektual mulk obyektlarining amortizatsiyasi', 0.00, 0.00),
                                                                                (259, 231321, 'Tadqiqot va ishlanmalar amortizatsiyasi', 0.00, 0.00),
                                                                                (260, 231322, 'Foydali qazilmalarni qazib olish amortizatsiyasi', 0.00, 0.00),
                                                                                (261, 421900, 'Budjet tashkilotlarining boshqa turdagi hisob-kitoblar bo‘yicha uzoq muddatli kreditor qarzlari', 0.00, 0.00),
                                                                                (262, 231323, 'Kompyuter dasturiy ta’minoti amortizatsiyasi', 0.00, 0.00),
                                                                                (263, 500000, 'Hisoblangan daromadlar', 0.00, 0.00),
                                                                                (264, 134000, 'Budjet tizimi budjetlaridan ajratiladigan transfertlar bo‘yicha debitor qarzlar', 0.00, 0.00),
                                                                                (265, 231324, 'Ma’lumotlar bazasi amortizatsiyasi', 0.00, 0.00),
                                                                                (266, 134100, 'O‘zbekiston Respublikasining respublika budjetidan ajratiladigan transfertlar bo‘yicha debitor qarzlar', 0.00, 0.00),
                                                                                (267, 231325, 'Ko‘ngilochar, kutubxona, badiiy va ijodiy qiymatliklar amortizatsiyasi', 0.00, 0.00),
                                                                                (268, 134200, 'Qoraqalpog‘iston Respublikasining respublika budjetining, viloyatlar viloyat budjetlarining va Toshkent shahri budjetidan ajratiladigan transfertlar bo‘yicha debitor qarzlar', 0.00, 0.00),
                                                                                (269, 231326, 'Boshqa turdagi intellektual mulk obyektlari amortizatsiyasi', 0.00, 0.00),
                                                                                (270, 140000, 'Budjet tizimi budjetlarining va boshqa budjetdan tashqari jamg‘armalarning daromadlari bo‘yicha debitor qarzlari', 0.00, 0.00),
                                                                                (271, 141000, 'Davlat budjetining daromadlari bo‘yicha debitor qarzlari', 0.00, 0.00),
                                                                                (272, 141100, 'O‘zbekiston Respublikasi respublika budjetining daromadlari bo‘yicha debitor qarzlari', 0.00, 0.00),
                                                                                (273, 141200, 'Qoraqalpog‘iston Respublikasi budjetining, viloyatlar va Toshkent shahar mahalliy budjetlarining daromadlari bo‘yicha debitor qarzlari', 0.00, 0.00),
                                                                                (274, 141210, 'Qoraqalpog‘iston Respublikasining respublika budjeti, viloyatlarning viloyat budjeti va Toshkent shahrining shahar budjetining daromadlari bo‘yicha debitor qarzlari', 0.00, 0.00),
                                                                                (275, 231400, 'Harbiy asosiy vositalar amortizatsiyasi', 0.00, 0.00),
                                                                                (276, 141220, 'Tumanlar va shaharlar budjetlarining daromadlari bo‘yicha debitor qarzlari', 0.00, 0.00),
                                                                                (277, 142000, 'Davlat maqsadli va boshqa budjetdan tashqari jamg‘armalarning daromadlari bo‘yicha debitor qarzlari', 0.00, 0.00),
                                                                                (278, 501000, 'O‘zbekiston Respublikasi respublika budjetining hisoblangan daromadlari', 0.00, 0.00),
                                                                                (279, 502000, 'Qoraqalpog‘iston Respublikasi budjetining, viloyatlar va Toshkent shahar mahalliy budjetlarining hisoblangan daromadlari', 0.00, 0.00),
                                                                                (280, 233000, 'Noishlab chiqarish aktivlarining amortizatsiyasi', 0.00, 0.00),
                                                                                (281, 502100, 'Qoraqalpog‘iston Respublikasi respublika budjetining, viloyatlar viloyat byudjetlarining va Toshkent shahri shahar budjetining hisoblangan daromadlari', 0.00, 0.00),
                                                                                (282, 502200, 'Tumanlar va shaharlar budjetlarining hisoblangan daromadlari ', 0.00, 0.00),
                                                                                (283, 901100, 'Markazlashgan holda olingan yoki berilgan asosiy vositalar', 0.00, 0.00),
                                                                                (284, 503000, 'Budjetdan moliyalashtirish', 0.00, 0.00),
                                                                                (285, 510000, 'Davlat maqsadli va boshqa budjetdan tashqari jamg‘armalarining hisoblangan daromadlari', 0.00, 0.00),
                                                                                (286, 901200, 'Markazlashgan holda olingan yoki berilgan tovar-moddiy zaxiralar', 0.00, 0.00),
                                                                                (287, 520000, 'Budjet tashkilotlarining budjetdan tashqari mablag‘lari bo‘yicha hisoblangan daromadlari', 0.00, 0.00),
                                                                                (288, 902000, 'Beg‘araz (bepul) olingan yoki berilgan moddiy qiymatliklar', 0.00, 0.00),
                                                                                (289, 902100, 'Beg‘araz (bepul) olingan yoki berilgan asosiy vositalar, qiymatliklar va nomoddiy aktivlar', 0.00, 0.00),
                                                                                (290, 902200, 'Beg‘araz (bepul) olingan yoki berilgan tovar-moddiy zaxiralar', 0.00, 0.00),
                                                                                (291, 520100, 'To‘lovlarning maxsus turlariga doir hisob-kitoblar bo‘yicha hisoblangan daromadlar', 0.00, 0.00),
                                                                                (292, 903000, 'Inventarizatsiya natijasida ortiqcha chiqqan mol-mulklar', 0.00, 0.00),
                                                                                (293, 909000, 'Asosiy vositalar, qiymatliklar va nomoddiy aktivlarni qayta baholash', 0.00, 0.00),
                                                                                (294, 910000, 'Boshqa realizatsiya va xarajatlar', 0.00, 0.00),
                                                                                (295, 520110, 'Maktabgacha ta’lim tashkilotlarida bolalar ta’minoti uchun ota-onalardan undiriladigan to‘lovlar bo‘yicha hisoblangan daromadlar', 0.00, 0.00),
                                                                                (296, 520120, 'Maktab-internatlar va litseylarda bolalarning ta’minoti uchun ota-onalardan undiriladigan to‘lovlar bo‘yicha hisoblangan daromadlar', 0.00, 0.00),
                                                                                (297, 520130, 'Boshqa ta’lim muassasalarida bolalar ta’minoti uchun ota-onalardan undiriladigan to‘lovlar bo‘yicha hisoblangan daromadlar', 0.00, 0.00),
                                                                                (298, 911000, 'Nomoliyaviy aktivlar va mahsulot (ish, xizmat)lar realizatsiyasi', 0.00, 0.00),
                                                                                (299, 520140, 'Budjet tashkilotlari tomonidan o‘quvchilar bolalar musiqa va san’at maktablari hamda maktabdan tashqari ta’lim muassasalarida ta’lim olganligi uchun undiriladigan to‘lovlar bo‘yicha hisoblangan daromadlar', 0.00, 0.00),
                                                                                (300, 911100, 'Nomoliyaviy aktivlar realizatsiyasi', 0.00, 0.00),
                                                                                (301, 233330, 'Boshqa turdagi tabiiy resurslar amortizatsiyasi', 0.00, 0.00),
                                                                                (302, 520150, 'Oliy va o‘rta maxsus, professional ta’limi muassasalarida o‘qitishning to‘lov-kontrakt mablag‘lari bo‘yicha hisoblangan daromadlar', 0.00, 0.00),
                                                                                (303, 911200, 'Mahsulot (ish, xizmat)lar realizatsiyasi', 0.00, 0.00),
                                                                                (304, 233331, 'Radiochastota spektri amortizatsiyasi', 0.00, 0.00),
                                                                                (305, 520160, 'Budjet tashkilotlari tomonidan statsionar davolash-profilaktika muassasalarida davolanayotganlar tarkibi ovqatlanishi uchun undiriladigan to‘lovlar bo‘yicha hisoblangan daromadlar', 0.00, 0.00),
                                                                                (306, 912000, 'Boshqa xarajatlar', 0.00, 0.00),
                                                                                (307, 233400, 'Nomoddiy noishlab chiqarish aktivlarining amortizatsiyasi', 0.00, 0.00),
                                                                                (308, 912100, 'Taqsimlanmagan xarajatlar', 0.00, 0.00),
                                                                                (309, 233410, 'Shartnoma, lizing va litsenziyalar amortizatsiyasi', 0.00, 0.00),
                                                                                (310, 912200, 'Davr xarajatlari', 0.00, 0.00),
                                                                                (311, 920000, 'Kurs farqi bo‘yicha foyda yoki zararlar', 0.00, 0.00),
                                                                                (312, 233411, 'Tijoriy operativ lizing amortizatsiyasi', 0.00, 0.00),
                                                                                (313, 233412, 'Tabiiy resurslardan foydalanishga ruxsatnoma amortizatsiyasi', 0.00, 0.00),
                                                                                (314, 921100, 'Kurs farqidan foyda', 0.00, 0.00),
                                                                                (315, 233413, 'Ma’lum turdagi faoliyatni amalga oshirish uchun ruxsatnoma amortizatsiyasi', 0.00, 0.00),
                                                                                (316, 922200, 'Kurs farqidan zarar', 0.00, 0.00),
                                                                                (317, 233414, 'Kelgusi tovar va xizmatlarga imtiyozli egalik qilishga ruxsatnomalar amortizatsiyasi', 0.00, 0.00),
                                                                                (318, 980000, 'Budjet tashkilotlarining jamg‘arib boriluvchi moliyaviy natijalari', 0.00, 0.00),
                                                                                (319, 233420, 'Gudvill va marketing aktivlari amortizatsiyasi', 0.00, 0.00),
                                                                                (320, 143000, 'Budjet tashkilotlarining budjetdan tashqari jamg‘armalarining daromadlari bo‘yicha debitor qarzlari', 0.00, 0.00),
                                                                                (321, 240000, 'Nomoliyaviy aktivlarga kapital qo‘yilmalar', 0.00, 0.00),
                                                                                (322, 981000, 'Budjet mablag‘lari bo‘yicha moliyaviy natija', 0.00, 0.00),
                                                                                (323, 982000, 'To‘lovlarning maxsus turlariga doir hisob-kitoblar bo‘yicha moliyaviy natija', 0.00, 0.00),
                                                                                (324, 983000, 'Ta’lim muassasalarida o‘qitishning to‘lov-kontrakt mablag‘lari bo‘yicha moliyaviy natija', 0.00, 0.00),
                                                                                (325, 144000, 'Budjet tashkilotlarining pensiya va nafaqalarni to‘lash uchun daromadlari bo‘yicha debitor qarzlari', 0.00, 0.00),
                                                                                (326, 984000, 'Budjet tashkilotining rivojlantirish jamg‘armasi hamda Tibbiyot tashkilotlarining moddiy rag‘batlantirish va rivojlantirish jamg‘armasi mablag‘lari bo‘yicha moliyaviy natija', 0.00, 0.00),
                                                                                (327, 984100, 'Budjet tashkilotining rivojlantirish jamg‘armasi mablag‘lari bo‘yicha moliyaviy natija', 0.00, 0.00),
                                                                                (328, 145000, 'Bojxona qo‘mitasining g‘aznachilikda milliy valyutadagi depozit shaxsiy g‘azna hisobvarag‘i daromadlar bo‘yicha debitor qarzlar', 0.00, 0.00),
                                                                                (329, 984200, 'Tibbiyot tashkilotlarining moddiy rag‘batlantirish va rivojlantirish jamg‘armalari mablag‘lari bo‘yicha moliyaviy natija', 0.00, 0.00),
                                                                                (330, 241000, 'Asosiy vositalarga kapital qo‘yilmalar', 0.00, 0.00),
                                                                                (331, 146000, 'O‘tgan yilgi debitorlik qarzdorliklar, kamomadlar, tekshiruv natijasiga ko‘ra to‘lovlar bo‘yicha daromadlarning debitor qarzlari', 0.00, 0.00),
                                                                                (332, 985000, 'Boshqa daromadlar bo‘yicha moliyaviy natija', 0.00, 0.00),
                                                                                (333, 241100, 'Bino va inshootlarga kapital qo‘yilmalar', 0.00, 0.00),
                                                                                (334, 520300, 'Budjet tashkilotini budjetdan tashqari rivojlantirish jamg‘armasi mablag‘lari bo‘yicha hisoblangan daromadlari', 0.00, 0.00),
                                                                                (335, 149000, 'Budjet tizimi budjetlari va boshqa budjetdan tashqari jamg‘armalarning kelib tushmagan hisoblangan daromadlari bo‘yicha debitor qarzdorliklar', 0.00, 0.00),
                                                                                (336, 241110, 'Turarjoy binolariga kapital qo‘yilmalar', 0.00, 0.00),
                                                                                (337, 986000, 'Budjetga va budjetdan tashqari jamg‘armalarga hisoblangan soliq va yig‘imlar bo‘yicha imtiyozlar', 0.00, 0.00),
                                                                                (338, 149100, 'Davlat budjetining kelib tushmagan hisoblangan daromadlari bo‘yicha debitor qarzdorliklar', 0.00, 0.00),
                                                                                (339, 241111, 'Turarjoy binolarini xarid (qabul) qilish', 0.00, 0.00),
                                                                                (340, 990000, 'Budjet ijrosining moliyaviy natijalari', 0.00, 0.00),
                                                                                (341, 241112, 'Qurilishi tugallanmagan turarjoy binolari', 0.00, 0.00),
                                                                                (342, 149200, 'Davlat maqsadli va boshqa budjetdan tashqari jamg‘armalarning kelib tushmagan hisoblangan daromadlari bo‘yicha debitor qarzdorliklar', 0.00, 0.00),
                                                                                (343, 241113, 'Turarjoy binolariga boshqa kapital qo‘yilmalar', 0.00, 0.00),
                                                                                (344, 150000, 'Budjet tashkilotlarining debitor qarzlari', 0.00, 0.00),
                                                                                (345, 151000, 'Budjet tashkilotlarining turli hisob-kitoblar bo‘yicha debitor qarzlari', 0.00, 0.00),
                                                                                (346, 991000, 'Davlat budjeti moliyaviy natijalari', 0.00, 0.00),
                                                                                (347, 241120, 'Noturarjoy binolariga kapital qo‘yilmalar', 0.00, 0.00),
                                                                                (348, 991100, 'Davlat budjeti mablag‘lari tushumining moliyaviy natijalari', 0.00, 0.00),
                                                                                (349, 241121, 'Noturarjoy binolarini xarid (qabul) qilish', 0.00, 0.00),
                                                                                (350, 151100, 'Budjet tashkilotlarining mahsulot yetkazib beruvchilar va pudratchilar bilan hisob-kitoblar bo‘yicha debitor qarzlari', 0.00, 0.00),
                                                                                (351, 241122, 'Qurilishi tugallanmagan noturarjoy binolari', 0.00, 0.00),
                                                                                (352, 151200, 'Budjet tashkilotlarining xaridor va buyurtmachilar bilan hisob-kitoblar bo‘yicha debitor qarzlari', 0.00, 0.00),
                                                                                (353, 241123, 'Noturarjoy binolariga boshqa kapital qo‘yilmalar', 0.00, 0.00),
                                                                                (354, 991200, 'Davlat budjeti mablag‘lari bo‘yicha xarajatlarning moliyaviy natijalari', 0.00, 0.00),
                                                                                (355, 151300, 'Budjet tashkilotlarining sug‘urta bo‘yicha to‘lovlaridan debitor qarzlari', 0.00, 0.00),
                                                                                (356, 241130, 'Boshqa inshootlarga kapital qo‘yilmalar', 0.00, 0.00),
                                                                                (357, 151400, 'Budjet tashkilotlarining to‘lovlarning maxsus turlariga doir hisob-kitoblardan debitor qarzlari', 0.00, 0.00),
                                                                                (358, 241131, 'Boshqa inshootlarni xarid (qabul) qilish', 0.00, 0.00),
                                                                                (359, 151900, 'Budjet tashkilotlarining boshqa turdagi hisob-kitoblardan debitor qarzlari', 0.00, 0.00),
                                                                                (360, 520310, 'Budjet tashkilotlarining rivojlantirish jamg‘armasi bo‘yicha hisoblangan daromadlari', 0.00, 0.00),
                                                                                (361, 152000, 'Budjet tashkilotlarining budjet va budjetdan tashqari jamg‘armalar bilan debitor qarzlari', 0.00, 0.00),
                                                                                (362, 992000, 'Budjet tashkilotining budjetdan tashqari jamg‘armalari bo‘yicha moliyaviy natijalari', 0.00, 0.00),
                                                                                (363, 152100, 'Budjet tashkilotlarining budjetga to‘lovlar bo‘yicha budjet bilan debitor qarzlari', 0.00, 0.00),
                                                                                (364, 992100, 'Budjet tashkilotining budjetdan tashqari mablag‘lari tushumining moliyaviy natijalari', 0.00, 0.00),
                                                                                (365, 241132, 'Qurilishi tugallanmagan boshqa inshootlar', 0.00, 0.00),
                                                                                (366, 152200, 'Budjet tashkilotlarining ijtimoiy soliq bo‘yicha debitor qarzlari', 0.00, 0.00),
                                                                                (367, 241133, 'Boshqa inshootlarga boshqa turdagi kapital qo‘yilmalar', 0.00, 0.00),
                                                                                (368, 992200, 'Budjet tashkilotining budjetdan tashqari mablag‘lari bo‘yicha xarajatlarining moliyaviy natijalari', 0.00, 0.00),
                                                                                (369, 241140, 'Yerni obodonlashtirishga kapital qo‘yilmalar', 0.00, 0.00),
                                                                                (370, 152300, 'Budjet tashkilotlarining shaxsiy jamg‘arib boriladigan Pensiya hisobvarag‘i badallari bo‘yicha debitor qarzlari', 0.00, 0.00),
                                                                                (371, 241200, 'Mashina va jihozlarga kapital qo‘yilmalar', 0.00, 0.00),
                                                                                (372, 520320, 'Tibbiyot tashkilotlarining moddiy rag‘batlantirish va rivojlantirish jamg‘armasi mablag‘lari bo‘yicha hisoblangan daromadlari', 0.00, 0.00),
                                                                                (373, 241210, 'Transport vositalariga kapital qo‘yilmalar', 0.00, 0.00),
                                                                                (374, 152400, 'Budjet tashkilotlarining budjetdan tashqari pensiya jamg‘armasi bilan debitor qarzlari', 0.00, 0.00),
                                                                                (375, 241211, 'Transport vositalarini xarid (qabul) qilish', 0.00, 0.00),
                                                                                (376, 520400, 'Budjet tashkilotlarining boshqa budjetdan tashqari hisoblangan daromadlari', 0.00, 0.00),
                                                                                (377, 153000, 'Budjet tashkilotlarining xodimlar va stipendiya oluvchilar bilan debitor qarzlari', 0.00, 0.00),
                                                                                (378, 241212, 'Transport vositalariga boshqa kapital qo‘yilmalar', 0.00, 0.00),
                                                                                (379, 520410, 'Taqsimlanishi nazarda tutilgan tushumlar bo‘yicha hisoblangan daromadlar', 0.00, 0.00),
                                                                                (380, 241220, 'Mashina va jihozlarga (transport vositalaridan tashqari) kapital qo‘yilmalar', 0.00, 0.00),
                                                                                (381, 241221, 'Mashina va jihozlarni (transport vositalaridan tashqari) xarid (qabul) qilish', 0.00, 0.00),
                                                                                (382, 153100, 'Budjet tashkilotlarining kamomadlarga doir debitor qarzlari', 0.00, 0.00),
                                                                                (383, 520420, 'Xodimlardan, ular ishlayotgan joyida ovqatlanganligi bo‘yicha hisob-kitoblardan tushadigan tushumlar bo‘yicha hisoblangan daromadlar', 0.00, 0.00),
                                                                                (384, 153200, 'Budjet tashkilotlarining xodimlar bilan ijtimoiy nafaqalar bo‘yicha debitor qarzlari', 0.00, 0.00),
                                                                                (385, 241222, 'Mashina va jihozlarga (transport vositalaridan tashqari) boshqa kapital qo‘yilmalar', 0.00, 0.00),
                                                                                (386, 520430, 'Ajratmalar hisobiga shakllanadigan vazirliklar va idoralarning budjetdan tashqari jamg‘armalari bo‘yicha hisoblangan daromadlar', 0.00, 0.00),
                                                                                (387, 241223, 'O‘rnatish uchun mo‘ljallangan asbob-uskunalar', 0.00, 0.00),
                                                                                (388, 520440, 'Umumta’lim muassasalarida darsliklar ijarasi to‘lovidan tushgan budjetdan tashqari mablag‘lari bo‘yicha hisoblangan daromadlar', 0.00, 0.00),
                                                                                (389, 520490, 'Budjet tashkilotlarining qonunchilik hujjatlariga muvofiq boshqa turdagi hisoblangan daromadlari', 0.00, 0.00),
                                                                                (390, 993000, 'Davlat maqsadli va boshqa budjetdan tashqari jamg‘armalari bo‘yicha moliyaviy natijalari', 0.00, 0.00),
                                                                                (391, 530000, 'Bojxona depozit tushumlari bo‘yicha hisoblangan daromadlar', 0.00, 0.00),
                                                                                (392, 993100, 'Davlat maqsadli va boshqa budjetdan tashqari jamg‘armalar mablag‘lari tushumining moliyaviy natijalari', 0.00, 0.00),
                                                                                (393, 540000, 'Budjet tashkilotlarining budjetdan tashqari pensiya jamg‘armasi mablag‘laridan pensiya, nafaqa va boshqa to‘lovlari hisoblangan daromadlari', 0.00, 0.00),
                                                                                (394, 153300, 'Budjet tashkilotlarining hisobdor shaxslar bilan debitor qarzlari', 0.00, 0.00),
                                                                                (395, 993200, 'Davlat maqsadli va boshqa budjetdan tashqari jamg‘armalari mablag‘lari bo‘yicha xarajatlarining moliyaviy natijalari', 0.00, 0.00),
                                                                                (396, 994000, 'Bojxona qo‘mitasining g‘aznachilikdagi depozit mablag‘larining moliyaviy natijalari', 0.00, 0.00),
                                                                                (397, 550000, 'O‘tgan yilgi debitorlik qarzdorliklar, kamomadlar, tekshiruv natijasiga ko‘ra to‘lovlar bo‘yicha hisoblangan daromadlari', 0.00, 0.00),
                                                                                (398, 153400, 'Budjet tashkilotlarining xodimlar bilan mehnatga haq to‘lash bo‘yicha debitor qarzlari', 0.00, 0.00),
                                                                                (399, 994100, 'Bojxona qo‘mitasining g‘aznachilikdagi depozit mablag‘lari tushumi bo‘yicha moliyaviy natijalari', 0.00, 0.00),
                                                                                (400, 153500, 'Budjet tashkilotlarining stipendiya oluvchilar bilan debitor qarzlari', 0.00, 0.00),
                                                                                (401, 994200, 'Bojxona qo‘mitasining g‘aznachilikdagi depozit mablag‘lari bo‘yicha xarajatlarining moliyaviy natijalari', 0.00, 0.00),
                                                                                (402, 153600, 'Budjet tashkilotlarining talabalar bilan boshqa debitor qarzlari', 0.00, 0.00),
                                                                                (403, 590000, 'Budjet tizimi budjetlarining va boshqa budjetdan tashqari jamg‘armalarining kelib tushmagan hisoblangan daromadlari', 0.00, 0.00),
                                                                                (404, 995000, 'Budjet tashkilotlarining Iqtisodiyot va moliya vazirligi huzuridagi budjetdan tashqari pensiya jamg‘armasi tomonidan ijtimoiy nafaqalarni to‘lash uchun o‘tkazib bergan pul mablag‘lari bo‘yicha moliyaviy natijalari', 0.00, 0.00),
                                                                                (405, 590100, 'Davlat budjetining kelib tushmagan hisoblangan daromadlari', 0.00, 0.00),
                                                                                (406, 154000, 'Budjet tashkilotlarining budjetdan tashqari mablag‘lari hisobidan debitor qarzlari', 0.00, 0.00),
                                                                                (407, 590200, 'Davlat maqsadli va boshqa budjetdan tashqari jamg‘armalarning kelib tushmagan hisoblangan daromadlari', 0.00, 0.00),
                                                                                (408, 160000, 'Tovar-moddiy zaxiralar', 0.00, 0.00),
                                                                                (409, 995100, 'Budjet tashkilotlarining Iqtisodiyot va moliya vazirligi huzuridagi budjetdan tashqari pensiya jamg‘armasi tomonidan ijtimoiy nafaqalarni to‘lash uchun o‘tkazib bergan pul mablag‘lari tushumining moliyaviy natijalari', 0.00, 0.00),
                                                                                (410, 161000, 'Xom ashyo va materiallar', 0.00, 0.00),
                                                                                (411, 995200, 'Budjet tashkilotlarining Iqtisodiyot va moliya vazirligi huzuridagi budjetdan tashqari pensiya jamg‘armasi tomonidan ijtimoiy nafaqalarni to‘lash uchun o‘tkazib bergan pul mablag‘lari bo‘yicha xarajatlarining moliyaviy natijalari', 0.00, 0.00),
                                                                                (412, 161100, 'Oziq-ovqat mahsulotlari', 0.00, 0.00),
                                                                                (413, 996000, 'O‘tgan yilgi debitorlik qarzdorliklar, kamomadlar, tekshiruv natijasiga ko‘ra to‘lovlar bo‘yicha moliyaviy natijalari', 0.00, 0.00),
                                                                                (414, 996100, 'O‘tgan yilgi debitorlik qarzdorliklar, kamomadlar, tekshiruv natijasiga ko‘ra milliy valyutadagi to‘lovlar tushumi bo‘yicha moliyaviy natijasi', 0.00, 0.00),
                                                                                (415, 161110, 'Joriy oziq-ovqat mahsulotlari', 0.00, 0.00),
                                                                                (416, 996200, 'O‘tgan yilning debitor qarzdorligini, kamomadlarni, tekshiruv natijasiga ko‘ra budjetga o‘tkazilishi lozim bo‘lgan mablag‘lari bo‘yicha xarajatlarining moliyaviy natijalari', 0.00, 0.00),
                                                                                (417, 1, 'Operativ ijaraga olingan asosiy vositalar va qiymatliklar', 0.00, 0.00),
                                                                                (418, 241300, 'Boshqa turdagi asosiy vositalarga kapital qo‘yilmalar', 0.00, 0.00),
                                                                                (419, 2, 'Mas’ul saqlashga olingan tovar-moddiy qimmatliklar', 0.00, 0.00),
                                                                                (420, 3, 'Qat’iy hisobot blanklari', 0.00, 0.00),
                                                                                (421, 241310, 'Etishtiriladigan biologik aktivlar', 0.00, 0.00),
                                                                                (422, 4, 'Ishonchsiz debitorlarning qarzlarini xarajatga chiqazilishi', 0.00, 0.00),
                                                                                (423, 241311, 'Etishtiriladigan biologik aktivlarni xarid (qabul) qilish', 0.00, 0.00),
                                                                                (424, 161120, 'Qish-bahor mavsumiga g‘amlanadigan oziq-ovqat mahsulotlari', 0.00, 0.00),
                                                                                (425, 5, 'O‘quvchilar va talabalarning qaytarilmagan moddiy qimmatliklar bo‘yicha qarzlari', 0.00, 0.00),
                                                                                (426, 241312, 'Etishtiriladigan biologik aktivlarga boshqa xarajatlar', 0.00, 0.00),
                                                                                (427, 241320, 'Intellektual mulk obyektlari', 0.00, 0.00),
                                                                                (428, 241321, 'Intellektual mulk obyektlarini xarid (qabul) qilish', 0.00, 0.00),
                                                                                (429, 161200, 'Dori-darmonlar, tibbiyotda foydalaniladigan vositalar, vaksinalar va bakteriologik preparatlar', 0.00, 0.00),
                                                                                (430, 241322, 'Intellektual mulk obyektlariga boshqa xarajatlar', 0.00, 0.00),
                                                                                (431, 241400, 'Harbiy asosiy vositalarga kapital qo‘yilmalar', 0.00, 0.00),
                                                                                (432, 161210, 'Dori-darmonlar va tibbiyotda foydalaniladigan vositalar', 0.00, 0.00),
                                                                                (433, 161220, 'Vaksinalar va bakteriologik preparatlar', 0.00, 0.00),
                                                                                (434, 161230, 'Ambulatoriya sharoitida davolanuvchi imtiyozli bemorlar kontingentiga retsept asosida bepul beriluvchi dori-darmonlar', 0.00, 0.00),
                                                                                (435, 242000, 'Qiymatliklarga kapital qo‘yilmalar', 0.00, 0.00),
                                                                                (436, 161240, 'Ijtimoiy ahamiyatga ega bo‘lgan dori vositalari va tibbiyot buyumlari', 0.00, 0.00),
                                                                                (437, 242100, 'Qiymatliklarni xarid (qabul) qilish', 0.00, 0.00),
                                                                                (438, 6, 'Ko‘chma sport sovrinlari va kuboklari', 0.00, 0.00),
                                                                                (439, 161300, 'Yonilg‘i, yoqilg‘i-moylash materiallari', 0.00, 0.00),
                                                                                (440, 7, 'To‘lanmagan yo‘llanmalar', 0.00, 0.00),
                                                                                (441, 8, 'Foydalanishdagi inventar va xo‘jalik jihozlari', 0.00, 0.00),
                                                                                (442, 161310, 'Yoqilg‘i neft mahsulotlari', 0.00, 0.00),
                                                                                (443, 9, 'Harbiy texnikalarning o‘quv predmetlari', 0.00, 0.00),
                                                                                (444, 161320, 'Suyultirilgan gaz', 0.00, 0.00),
                                                                                (445, 161330, 'Ko‘mir', 0.00, 0.00),
                                                                                (446, 161340, 'Boshqa turdagi yonilg‘i materiallari', 0.00, 0.00),
                                                                                (447, 161400, 'Xo‘jalik va kanselyariya mahsulotlari', 0.00, 0.00),
                                                                                (448, 610000, 'Davlat budjeti mablag‘lari hisobidan budjetlararo olingan va berilgan mablag‘lar', 0.00, 0.00),
                                                                                (449, 611000, 'O‘zbekiston Respublikasining respublika budjetidan olingan va berilgan mablag‘lar', 0.00, 0.00),
                                                                                (450, 611100, 'O‘zbekiston Respublikasining respublika budjetidan daromadlar bo‘yicha olingan va berilgan mablag‘lar', 0.00, 0.00),
                                                                                (451, 10, 'Eskirganlarining o‘rniga berilgan transport vositalarining ehtiyot qismlari', 0.00, 0.00),
                                                                                (452, 611200, 'O‘zbekiston Respublikasining respublika budjetidan xarajatlar bo‘yicha olingan va berilgan mablag‘lar', 0.00, 0.00),
                                                                                (453, 612000, 'Qoraqalpog‘iston Respublikasining respublika budjeti, viloyatlarning viloyat budjeti va Toshkent shahrining shahar budjetidan olingan va berilgan mablag‘lar', 0.00, 0.00),
                                                                                (454, 612100, 'Qoraqalpog‘iston Respublikasining respublika budjeti, viloyatlarning viloyat budjeti va Toshkent shahrining shahar budjetidan daromadlar bo‘yicha olingan va berilgan mablag‘lar', 0.00, 0.00),
                                                                                (455, 612200, 'Qoraqalpog‘iston Respublikasining respublika budjeti, viloyatlarning viloyat budjeti va Toshkent shahrining shahar budjetidan xarajatlar bo‘yicha olingan va berilgan mablag‘lar', 0.00, 0.00),
                                                                                (456, 242200, 'Qiymatliklarga boshqa kapital qo‘yilmalar', 0.00, 0.00),
                                                                                (457, 243000, 'Noishlab chiqarish aktivlariga kapital qo‘yilmalar', 0.00, 0.00),
                                                                                (458, 161410, 'Xo‘jalik mahsulotlari', 0.00, 0.00),
                                                                                (459, 243100, 'Yerni xarid qilish xarajatlari', 0.00, 0.00),
                                                                                (460, 161420, 'Kanselyariya mahsulotlari (qog‘ozdan tashqari)', 0.00, 0.00),
                                                                                (461, 243200, 'Mineral va energiya resurslariga kapital qo‘yilmalar', 0.00, 0.00),
                                                                                (462, 161430, 'Qog‘oz', 0.00, 0.00),
                                                                                (463, 243300, 'Boshqa turdagi tabiiy aktivlarga kapital qo‘yilmalar', 0.00, 0.00),
                                                                                (464, 161500, 'Kiyim-kechak, poyabzal va choyshab-g‘iloflar', 0.00, 0.00),
                                                                                (465, 243310, 'Nomahsuldor biologik aktivlarga xarajatlar', 0.00, 0.00),
                                                                                (466, 161510, 'Kiyim-kechak va poyabzallar', 0.00, 0.00),
                                                                                (467, 243320, 'Suv resurslariga xarajatlar', 0.00, 0.00),
                                                                                (468, 161520, 'Choyshab-g‘iloflar', 0.00, 0.00),
                                                                                (469, 243330, 'Boshqa turdagi tabiiy resurslarga xarajatlar', 0.00, 0.00),
                                                                                (470, 161600, 'Qurilish materiallari', 0.00, 0.00),
                                                                                (471, 243400, 'Nomoddiy noishlab chiqarish aktivlariga kapital qo‘yilmalar', 0.00, 0.00),
                                                                                (472, 161700, 'Mashina va asbob-uskunalarning ehtiyot qismlari, butlovchi buyumlar va sotib olinadigan yarim tayyor mahsulotlar', 0.00, 0.00),
                                                                                (473, 161800, 'Biologik zaxiralar', 0.00, 0.00),
                                                                                (474, 161810, 'Boquvdagi hayvonlar', 0.00, 0.00),
                                                                                (475, 161900, 'Boshqa xomashyo va materiallar', 0.00, 0.00),
                                                                                (476, 162000, 'Tugallanmagan ishlab chiqarish', 0.00, 0.00),
                                                                                (477, 620000, 'Davlat maqsadli va boshqa budjetdan tashqari jamg‘armalarning mablag‘lari hisobidan o‘zaro hisob-kitoblar', 0.00, 0.00),
                                                                                (478, 621000, 'Davlat maqsadli va boshqa budjetdan tashqari jamg‘armalarning respublika mablag‘lari hisobidan o‘zaro hisob-kitoblar', 0.00, 0.00),
                                                                                (479, 163000, 'Tayyor mahsulot', 0.00, 0.00),
                                                                                (480, 622000, 'Davlat maqsadli va boshqa budjetdan tashqari jamg‘armalarning Qoraqalpog‘iston Respublikasining respublika darajasidagi, viloyatlarning viloyat darajasidagi va Toshkent shahrining shahar darajasidagi mablag‘lari hisobidan o‘zaro hisob-kitoblar', 0.00, 0.00),
                                                                                (481, 164000, 'Qayta sotish uchun tovarlar', 0.00, 0.00),
                                                                                (482, 623000, 'Davlat maqsadli va boshqa budjetdan tashqari jamg‘armalarning tumanlar va shaharlar darajasidagi mablag‘lari hisobidan o‘zaro hisob-kitoblar', 0.00, 0.00),
                                                                                (483, 165000, 'Harbiy zaxiralar', 0.00, 0.00),
                                                                                (484, 170000, 'Tovar-moddiy zaxiralarga xarajatlar', 0.00, 0.00),
                                                                                (485, 180000, 'Tovarlarga (ishlarga, xizmatlarga) xarajatlar', 0.00, 0.00),
                                                                                (486, 210000, 'Moliyaviy mablag‘lar bo‘yicha uzoq muddatli debitor qarzlar', 0.00, 0.00),
                                                                                (487, 630000, 'Budjet tashkilotlarining budjetdan tashqari mablag‘lari hisobidan o‘zaro hisob-kitoblari', 0.00, 0.00),
                                                                                (488, 211000, 'Uzoq muddatli depozitlar', 0.00, 0.00),
                                                                                (489, 640000, 'Davlat budjeti mablag‘lari hisobidan olingan transfertlar bo‘yicha o‘zaro hisob-kitoblar', 0.00, 0.00),
                                                                                (490, 211100, 'Uzoq muddatli ichki depozitlar', 0.00, 0.00);
INSERT INTO `chart_of_accounts` (`id`, `number`, `name`, `debit`, `credit`) VALUES
                                                                                (491, 640100, 'O‘zbekiston Respublikasining respublika budjetidan olingan transfertlar bo‘yicha o‘zaro hisob-kitoblar', 0.00, 0.00),
                                                                                (492, 211200, 'Uzoq muddatli tashqi depozitlar', 0.00, 0.00),
                                                                                (493, 640200, 'Qoraqalpog‘iston Respublikasi respublika budjeti, viloyatlar viloyat budjetlari va Toshkent shahri shahar budjetidan olingan transfertlar bo‘yicha o‘zaro hisob-kitoblar', 0.00, 0.00),
                                                                                (494, 700000, 'Hisoblangan haqiqiy xarajatlar', 0.00, 0.00),
                                                                                (495, 710000, 'Budjet mablag‘laridan hisoblangan haqiqiy xarajatlar', 0.00, 0.00),
                                                                                (496, 720000, 'To‘lovlarning maxsus turlariga doir hisob-kitoblar bo‘yicha mablag‘lar hisobiga amalga oshirilgan haqiqiy xarajatlar', 0.00, 0.00),
                                                                                (497, 730000, 'Ta’lim muassasalarida o‘qitishning to‘lov-kontrakt shaklidan tushgan tushumlar hisobidan amalga oshirilgan haqiqiy xarajatlar', 0.00, 0.00),
                                                                                (498, 243410, 'Shartnoma, lizing va litsenziyalarga xarajatlar', 0.00, 0.00),
                                                                                (499, 243420, 'Gudvill va marketing aktivlariga xarajatlar', 0.00, 0.00),
                                                                                (500, 301000, 'Hisob-kitoblar markazining majburiyatlari', 0.00, 0.00),
                                                                                (501, 301100, 'Hisob-kitoblar markazining ichki hisob-kitob markazlari mablag‘lari bo‘yicha majburiyatlari', 0.00, 0.00),
                                                                                (502, 301101, 'Hisob-kitoblar markazining ichki hisob-kitob markazlari bilan davlat budjeti mablag‘lari bo‘yicha majburiyatlari', 0.00, 0.00),
                                                                                (503, 301102, 'Hisob-kitoblar markazining ichki hisob-kitob markazlari bilan davlat maqsadli va boshqa budjetdan tashqari jamg‘arma mablag‘lari bo‘yicha majburiyatlari', 0.00, 0.00),
                                                                                (504, 301200, 'Ichki hisob-kitob markazlaridan hisob-kitoblar markazining taqsimlanishi nazarda tutilgan mablag‘lari bo‘yicha majburiyatlari', 0.00, 0.00),
                                                                                (505, 301201, 'Ichki hisob-kitob markazlaridan hisob-kitoblar markazining taqsimlanishi nazarda tutilgan davlat budjeti mablag‘lari bo‘yicha majburiyatlari', 0.00, 0.00),
                                                                                (506, 301202, 'Ichki hisob-kitob markazlaridan hisob-kitoblar markazining taqsimlanishi nazarda tutilgan Davlat maqsadli va boshqa budjetdan tashqari jamg‘arma mablag‘lari bo‘yicha majburiyatlari', 0.00, 0.00),
                                                                                (507, 301300, 'Hisob-kitoblar markazining depozit va Yagona g‘azna hisobvarag‘idagi vaqtinchalik bo‘sh turgan mablag‘larni jalb etish bo‘yicha majburiyatlari', 0.00, 0.00),
                                                                                (508, 301301, 'Hisob-kitoblar markazining depozit mablag‘lari bo‘yicha majburiyatlari', 0.00, 0.00),
                                                                                (509, 301302, 'Hisob-kitoblar markazining Yagona g‘azna hisobvarag‘idagi vaqtinchalik bo‘sh turgan mablag‘larni jalb etish bo‘yicha majburiyatlari', 0.00, 0.00),
                                                                                (510, 301900, 'Yagona g‘azna hisobvarag‘idagi aniqlanmagan tushumlar bo‘yicha majburiyatlar', 0.00, 0.00),
                                                                                (511, 301901, 'Yagona g‘azna hisobvarag‘idagi davlat budjetiga aniqlanmagan tushumlar bo‘yicha majburiyatlar', 0.00, 0.00),
                                                                                (512, 212000, 'Berilgan o‘rta va uzoq muddatli kreditlar', 0.00, 0.00),
                                                                                (513, 301902, 'Yagona g‘azna hisobvarag‘idagi davlat maqsadli va boshqa budjetdan tashqari jamg‘armalarga aniqlanmagan tushumlar bo‘yicha majburiyatlar', 0.00, 0.00),
                                                                                (514, 310000, 'Moliyaviy mablag‘lar bo‘yicha joriy majburiyatlar', 0.00, 0.00),
                                                                                (515, 212100, 'Berilgan o‘rta va uzoq muddatli ichki kreditlar', 0.00, 0.00),
                                                                                (516, 212110, 'Nomoliyaviy davlat tashkilotlariga berilgan o‘rta va uzoq muddatli ichki kreditlar', 0.00, 0.00),
                                                                                (517, 311000, 'Olingan qisqa muddatli kreditlar bo‘yicha majburiyatlar', 0.00, 0.00),
                                                                                (518, 311100, 'Olingan qisqa muddatli ichki kreditlar bo‘yicha majburiyatlar', 0.00, 0.00),
                                                                                (519, 311110, 'Nomoliyaviy davlat tashkilotlaridan olingan qisqa muddatli ichki kreditlar bo‘yicha majburiyatlar', 0.00, 0.00),
                                                                                (520, 311120, 'Nodavlat notijorat tashkilotlardan olingan qisqa muddatli ichki kreditlar bo‘yicha majburiyatlar', 0.00, 0.00),
                                                                                (521, 212120, 'Nodavlat notijorat tashkilotlarga berilgan o‘rta va uzoq muddatli ichki kreditlar', 0.00, 0.00),
                                                                                (522, 311130, 'Moliyaviy tashkilotlaridan olingan qisqa muddatli ichki kreditlar bo‘yicha majburiyatlar', 0.00, 0.00),
                                                                                (523, 212130, 'Moliyaviy tashkilotlarga berilgan o‘rta va uzoq muddatli ichki kreditlar', 0.00, 0.00),
                                                                                (524, 212190, 'Boshqa berilgan o‘rta va uzoq muddatli ichki kreditlar', 0.00, 0.00),
                                                                                (525, 212200, 'Berilgan o‘rta va uzoq muddatli tashqi kreditlar', 0.00, 0.00),
                                                                                (526, 213000, 'Aksiya va kapital', 0.00, 0.00),
                                                                                (527, 213100, 'Ichki aksiya va kapital', 0.00, 0.00),
                                                                                (528, 213200, 'Tashqi aksiya va kapital', 0.00, 0.00),
                                                                                (529, 311190, 'Boshqa olingan qisqa muddatli ichki kreditlar bo‘yicha majburiyatlar', 0.00, 0.00),
                                                                                (530, 311200, 'Olingan qisqa muddatli tashqi kreditlar bo‘yicha majburiyatlar', 0.00, 0.00),
                                                                                (531, 311210, 'Xorijiy hukumatlardan olingan qisqa muddatli tashqi kreditlar bo‘yicha majburiyatlar', 0.00, 0.00),
                                                                                (532, 214000, 'Olingan o‘rta va uzoq muddatli qimmatli qog‘ozlar (aksiyalar bundan mustasno)', 0.00, 0.00),
                                                                                (533, 214100, 'Olingan o‘rta va uzoq muddatli ichki qimmatli qog‘ozlar (aksiyalar bundan mustasno)', 0.00, 0.00),
                                                                                (534, 214200, 'Olingan o‘rta va uzoq muddatli tashqi qimmatli qog‘ozlar (aksiyalar bundan mustasno)', 0.00, 0.00),
                                                                                (535, 215000, 'Berilgan uzoq muddatli ssudalar', 0.00, 0.00),
                                                                                (536, 311220, 'Xalqaro tashkilotlardan olingan qisqa muddatli tashqi kreditlar bo‘yicha majburiyatlar', 0.00, 0.00),
                                                                                (537, 215100, 'Budjet mablag‘laridan berilgan uzoq muddatli ssudalar', 0.00, 0.00),
                                                                                (538, 311230, 'Moliyaviy tashkilotlardan (xalqaro tashkilotlar bundan mustasno) olingan qisqa muddatli tashqi kreditlar bo‘yicha majburiyatlar', 0.00, 0.00),
                                                                                (539, 215110, 'Respublika budjetidan mahalliy budjetlarga berilgan uzoq muddatli budjet ssudalari', 0.00, 0.00),
                                                                                (540, 215120, 'Yuqori mahalliy budjetdan quyi mahalliy budjetlarga berilgan uzoq muddatli budjet ssudalari', 0.00, 0.00),
                                                                                (541, 312000, 'Chiqarilgan qisqa muddatli qimmatli qog‘ozlar (aksiya bundan mustasno) bo‘yicha majburiyatlar', 0.00, 0.00),
                                                                                (542, 312100, 'Chiqarilgan qisqa muddatli ichki qimmatli qog‘ozlar (aksiya bundan mustasno) bo‘yicha majburiyatlar', 0.00, 0.00),
                                                                                (543, 312200, 'Chiqarilgan qisqa muddatli tashqi qimmatli qog‘ozlar (aksiya bundan mustasno) bo‘yicha majburiyatlar', 0.00, 0.00),
                                                                                (544, 320000, 'Budjetlararo munosabatlar bo‘yicha kreditor qarzlar', 0.00, 0.00),
                                                                                (545, 321000, 'Olingan qisqa muddatli ssudalar', 0.00, 0.00),
                                                                                (546, 321100, 'Budjet mablag‘laridan olingan qisqa muddatli ssudalar', 0.00, 0.00),
                                                                                (547, 321110, 'Respublika budjetidan mahalliy budjetlarga olingan qisqa muddatli budjet ssudalari', 0.00, 0.00),
                                                                                (548, 321120, 'Yuqori mahalliy budjetdan olingan qisqa muddatli budjet ssudalari', 0.00, 0.00),
                                                                                (549, 321130, 'Davlat maqsadli va boshqa budjetdan tashqari jamg‘armalariga budjet mablag‘lari hisobidan olingan qisqa muddatli ssudalar', 0.00, 0.00),
                                                                                (550, 321200, 'Davlat maqsadli va boshqa budjetdan tashqari jamg‘armalarga Davlat maqsadli jamg‘armalari hisobidan olingan qisqa muddatli ssudalar', 0.00, 0.00),
                                                                                (551, 322000, 'Budjetlar o‘rtasidagi o‘zaro hisob-kitoblar bo‘yicha kreditor qarzlar', 0.00, 0.00),
                                                                                (552, 322100, 'Respublika budjeti bilan o‘zaro hisob-kitoblar bo‘yicha kreditor qarzlar', 0.00, 0.00),
                                                                                (553, 322200, 'Mahalliy budjetlar bilan o‘zaro hisob-kitoblar bo‘yicha kreditor qarzlar', 0.00, 0.00),
                                                                                (554, 322300, 'Davlat budjeti bajarilishi jarayonida yuzaga keladigan boshqa o‘zaro-hisob kitoblar bo‘yicha kreditor qarzlar', 0.00, 0.00),
                                                                                (555, 323000, 'Davlat maqsadli va boshqa budjetdan tashqari jamg‘armalarning mablag‘laridan o‘zaro hisob-kitoblar bo‘yicha kreditor qarzlar', 0.00, 0.00),
                                                                                (556, 323100, 'Davlat maqsadli va boshqa budjetdan tashqari jamg‘armalarning respublika mablag‘laridan o‘zaro hisob-kitoblar bo‘yicha kreditor qarzlar', 0.00, 0.00),
                                                                                (557, 323200, 'Davlat maqsadli va boshqa budjetdan tashqari jamg‘armalarning Qoraqalpog‘iston Respublikasining respublika darajasidagi, viloyatlarning viloyat darajasidagi va Toshkent shahrining shahar darajasidagi mablag‘laridan o‘zaro hisob-kitoblar bo‘yicha kreditor qarzlar', 0.00, 0.00),
                                                                                (558, 323300, 'Davlat maqsadli va boshqa budjetdan tashqari jamg‘armalarning tumanlar va shaharlar darajasidagi mablag‘laridan o‘zaro hisob-kitoblar bo‘yicha kreditor qarzlar', 0.00, 0.00),
                                                                                (559, 324000, 'Budjet tizimi budjetlaridan ajratiladigan transfertlar bo‘yicha kreditor qarzlar', 0.00, 0.00);

-- --------------------------------------------------------

--
-- Структура таблицы `classificator`
--

CREATE TABLE `classificator` (
                                 `ID` int UNSIGNED NOT NULL,
                                 `article` int NOT NULL,
                                 `details` text CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `classificator`
--

INSERT INTO `classificator` (`ID`, `article`, `details`) VALUES
                                                             (1, 4111100, 'Основная заработная плата'),
                                                             (2, 4111210, 'Средства Директорского фонда поощрения отличившихся работников ...'),
                                                             (3, 4111220, 'Надбавки и доплаты работникам медицинских организаций'),
                                                             (4, 4299100, 'Ежемесячные компенсационные выплаты по оплате жилищно-коммунальных услуг'),
                                                             (5, 4711110, 'Пособия по безработице'),
                                                             (6, 4711120, 'Пособия по временной нетрудоспособности'),
                                                             (7, 4711130, 'Пособия при рождении ребенка'),
                                                             (8, 4711140, 'Пособия на погребение'),
                                                             (9, 4711150, 'Пособия по беременности и родам'),
                                                             (10, 4711160, 'Оплата дополнительного дня в месяц одному из родителей (опекуну, попечителю) ...'),
                                                             (11, 4711170, 'Пособие инвалидам с детства, престарелым и нетрудоспособным гражданам, не ...'),
                                                             (12, 4711410, 'Досрочные пенсии'),
                                                             (13, 4711420, 'Пенсии не работающим пенсионерам'),
                                                             (14, 4711430, 'Пенсии работающим пенсионерам, выплачиваемые в размере 50%'),
                                                             (15, 4711440, 'Пенсии работающим пенсионерам, выплачиваемые в размере 100%'),
                                                             (16, 4721100, 'Ежемесячные пособия по уходу за ребенком до достижения им возраста 2-х лет ...'),
                                                             (17, 4721200, 'Пособия семьям с несовершеннолетними детьми'),
                                                             (18, 4721300, 'Материальная помощь малообеспеченным семьям'),
                                                             (19, 4821400, 'Стипендии'),
                                                             (20, 4121100, 'Единый социальный платеж'),
                                                             (21, 4121200, 'Другие взносы/отчисления на социальные нужды'),
                                                             (22, 4122000, 'Условно рассчитываемые взносы/отчисления на социальные нужды'),
                                                             (23, 4311100, 'Жилые здания'),
                                                             (24, 4311200, 'Нежилые здания'),
                                                             (25, 4312110, 'Расходы на проектно-изыскательские работы'),
                                                             (26, 4312900, 'Другие сооружения'),
                                                             (27, 4319000, 'Другие расходы по проектированию основных средств'),
                                                             (28, 4321100, 'Жилые здания'),
                                                             (29, 4321200, 'Нежилые здания'),
                                                             (30, 4322100, 'Автомобильные дороги общего пользования'),
                                                             (31, 4322900, 'Другие сооружения'),
                                                             (32, 4329900, 'Другие расходы, связанные со строительством и реконструкцией основных фондов'),
                                                             (33, 4211000, 'В пределах республики'),
                                                             (34, 4212000, 'Связанные с зарубежными поездками'),
                                                             (35, 4221000, 'Электроэнергия'),
                                                             (36, 4222000, 'Природный газ'),
                                                             (37, 4223000, 'Горячая вода и тепловая энергия'),
                                                             (38, 4224000, 'Холодная вода и канализация'),
                                                             (39, 4225000, 'Услуги по уборке и вывоза мусору, а так же приобретение энергетических и других ...'),
                                                             (40, 4231000, 'Земля'),
                                                             (41, 4232100, 'Жилые здания'),
                                                             (42, 4232200, 'Нежилые здания'),
                                                             (43, 4233100, 'Автомобильные дороги общего пользования'),
                                                             (44, 4233900, 'Прочие сооружения'),
                                                             (45, 4234100, 'Транспортные средства'),
                                                             (46, 4234910, 'Мебель и офисное оборудование'),
                                                             (47, 4234920, 'Компьютерное оборудование, вычислительная и аудио-видео техника'),
                                                             (48, 4234930, 'Приборы учета электроэнергии и коммунальных услуг'),
                                                             (49, 4234990, 'Другие машины, оборудование и техника'),
                                                             (50, 4239000, 'Другие виды расходов по содержанию и текущему ремонту'),
                                                             (51, 4241000, 'Земля'),
                                                             (52, 4242100, 'Жилые помещения'),
                                                             (53, 4242200, 'Нежилые здания'),
                                                             (54, 4243000, 'Сооружения'),
                                                             (55, 4244100, 'Транспортные средства'),
                                                             (56, 4244910, 'Мебель и офисное оборудование'),
                                                             (57, 4244920, 'Компьютерное оборудование, вычислительная и аудио-видео техника'),
                                                             (58, 4244990, 'Другие машины, оборудование и техника'),
                                                             (59, 4249000, 'Другие виды расходов по аренде'),
                                                             (60, 4251100, 'Государственные резервы'),
                                                             (61, 4251200, 'Продовольственные запасы'),
                                                             (62, 4251900, 'Другие стратегические резервы'),
                                                             (63, 4252110, 'Товарно-материальных запасов (кроме бумаги)'),
                                                             (64, 4252120, 'Расходы на приобретение бумаги'),
                                                             (65, 4252200, 'Одежды, обуви и постельных принадлежностей'),
                                                             (66, 4252300, 'Продуктов питания'),
                                                             (67, 4252410, 'Медикаменты и предметы медицинского назначения'),
                                                             (68, 4252420, 'Вакцины и бактериологические препараты'),
                                                             (69, 4252430, 'Медикаменты, предоставляемые по бесплатным рецептам льготному контингенту ...'),
                                                             (70, 4252500, 'Топливо и ГСМ'),
                                                             (71, 4252600, 'Уголь'),
                                                             (72, 4252900, 'Другие запасы материальных средств'),
                                                             (73, 4291000, 'Расходы на обучение'),
                                                             (74, 4292100, 'Телефонные, телеграфные и почтовые услуги'),
                                                             (75, 4292200, 'Информационные и коммуникационные услуги'),
                                                             (76, 4293000, 'Услуги по охране объектов'),
                                                             (77, 4299990, 'Прочие расходы на приобретение товаров и услуг'),
                                                             (78, 4331100, 'Жилые здания'),
                                                             (79, 4331200, 'Нежилые здания'),
                                                             (80, 4332100, 'Автомобильные дороги общего пользования'),
                                                             (81, 4332900, 'Другие сооружения'),
                                                             (82, 4333100, 'Транспортные средства'),
                                                             (83, 4333900, 'Прочие машины, оборудование и техника'),
                                                             (84, 4339000, 'Другие виды расходов по капитальному ремонту прочих основных средств'),
                                                             (85, 4341100, 'Жилые здания'),
                                                             (86, 4341200, 'Нежилые здания'),
                                                             (87, 4342100, 'Автомобильные дороги общего пользования'),
                                                             (88, 4342900, 'Другие сооружения'),
                                                             (89, 4343100, 'Транспортные средства'),
                                                             (90, 4343900, 'Прочие машины, оборудование и техника'),
                                                             (91, 4349000, 'Другие виды расходов по среднему ремонту прочих основных средств'),
                                                             (92, 4351000, 'Земля'),
                                                             (93, 4352100, 'Жилые здания'),
                                                             (94, 4352200, 'Нежилые здания'),
                                                             (95, 4353000, 'Сооружения'),
                                                             (96, 4354100, 'Транспортные средства'),
                                                             (97, 4354910, 'Мебель и офисное оборудование'),
                                                             (98, 4354920, 'Компьютерное оборудование, вычислительная, аудио-видео техника, информационная ...'),
                                                             (99, 4354930, 'Приборы учета электроэнергии и коммунальных услуг'),
                                                             (100, 4354990, 'Прочая техника'),
                                                             (101, 4355100, 'Культивируемые активы'),
                                                             (102, 4355200, 'Нематериальные активы'),
                                                             (103, 4355300, 'Библиотечный фонд'),
                                                             (104, 4390100, 'Прочие расходы к заказчику'),
                                                             (105, 4390200, 'Расходы для строительного подряда'),
                                                             (106, 4390300, 'Прочие расходы заказчика'),
                                                             (107, 4411100, 'Иностранным Правительствам'),
                                                             (108, 4411200, 'Международным организациям'),
                                                             (109, 4411300, 'Финансовым организациям, кроме международных организаций'),
                                                             (110, 4411900, 'Другим нерезидентам'),
                                                             (111, 4412100, 'По казначейским векселям'),
                                                             (112, 4412200, 'По облигациям'),
                                                             (113, 4421100, 'Центральному Банку'),
                                                             (114, 4421200, 'Коммерческим банкам'),
                                                             (115, 4421300, 'Другим финансовым организациям'),
                                                             (116, 4421400, 'Нефинансовым организациям'),
                                                             (117, 4422100, 'По казначейским векселям'),
                                                             (118, 4422200, 'По облигациям'),
                                                             (119, 4430000, 'Другим единицам сектора государственного управления'),
                                                             (120, 4511000, 'Нефинансовым государственным организациям'),
                                                             (121, 4512000, 'Финансовым государственным организациям'),
                                                             (122, 4521000, 'Нефинансовым частным предприятиям'),
                                                             (123, 4522000, 'Финансовым частным предприятиям'),
                                                             (124, 4530000, 'Негосударственным некоммерческим организациям'),
                                                             (125, 4611000, 'Текущие'),
                                                             (126, 4612000, 'Капитальные'),
                                                             (127, 4621000, 'Текущие'),
                                                             (128, 4622000, 'Капитальные'),
                                                             (129, 4631000, 'Текущие'),
                                                             (130, 4632000, 'Капитальные'),
                                                             (131, 4641110, 'Республике Каракалпакстан'),
                                                             (132, 4641120, 'Областям и городу Ташкенту'),
                                                             (133, 4641130, 'Районам и городам'),
                                                             (134, 4641140, 'Государственным целевым фондам'),
                                                             (135, 4641210, 'Республике Каракалпакстан'),
                                                             (136, 4641220, 'Областям и городу Ташкенту'),
                                                             (137, 4641230, 'Районам и городам'),
                                                             (138, 4641240, 'Государственным целевым фондам'),
                                                             (139, 4641310, 'Республике Каракалпакстан'),
                                                             (140, 4641320, 'Областям и городу Ташкенту'),
                                                             (141, 4641330, 'Районам и городам'),
                                                             (142, 4642110, 'Республике Каракалпакстан'),
                                                             (143, 4642120, 'Областям и городу Ташкенту'),
                                                             (144, 4642130, 'Районам и городам'),
                                                             (145, 4642140, 'Государственным целевым фондам'),
                                                             (146, 4642210, 'Финансовым организациям'),
                                                             (147, 4642220, 'Нефинансовым организациям'),
                                                             (148, 4721400, 'Возмещение расходов за оказанную на бесплатной основе высококвалифицированную ...'),
                                                             (149, 4721600, 'Пособия детям-сиротам и детям, оставшихся без попечения родителей'),
                                                             (150, 4721900, 'Другие пособия по социальной помощи в денежной форме'),
                                                             (151, 4722100, 'Пособия по социальной поддержке учащихся из малообеспеченных семей, детей-сирот ...'),
                                                             (152, 4722200, 'Расходы на обеспечение зимней одеждой и обувью'),
                                                             (153, 4722300, 'Расходы на приобретения учебников'),
                                                             (154, 4722400, 'Расходы на обеспечение проездными карточками'),
                                                             (155, 4722500, 'Расходы на обеспечение бесплатным питанием'),
                                                             (156, 4722600, 'Расходы на приобретения продуктов питания для одиноких престарелых'),
                                                             (157, 4722700, 'Расходы на приобретения медикаментов, для льготного контингента, представляемой ...'),
                                                             (158, 4722800, 'Расходы на обеспечение нуждающихся инвалидов протезно-ортопедическими изделиями ...'),
                                                             (159, 4722900, 'Другие виды пособий по социальной помощи в натуральном выражении'),
                                                             (160, 4731000, 'Социальные пособия, предоставляемые работодателями в денежной форме'),
                                                             (161, 4732000, 'Социальные пособия, предоставляемые работодателями в натуральном выражении'),
                                                             (162, 4810000, 'Расходы, связанные с собственностью, кроме процентов'),
                                                             (163, 4821110, 'Кадастровые, землеустроительные и топографо-геодезические, картографические работы'),
                                                             (164, 4821120, 'Представительские расходы'),
                                                             (165, 4821130, 'Расходы на приобретение ученических принадлежностей для первоклассников'),
                                                             (166, 4821190, 'Прочие расходы'),
                                                             (167, 4821200, 'Членства в международные и межгосударственные организации'),
                                                             (168, 4821300, 'Правительственные премии'),
                                                             (169, 4821500, 'Возмещение ущерба, причиненного гражданам'),
                                                             (170, 4821600, 'Расходы на формирование Фонда материального стимулирования и развития медицинских ...'),
                                                             (171, 4822000, 'Капитальные'),
                                                             (172, 4911100, 'Депозиты'),
                                                             (173, 4911200, 'Ценные бумаги, кроме акций'),
                                                             (174, 4911310, 'Ссуды, выдаваемые Республике Каракалпакстан'),
                                                             (175, 4911320, 'Ссуды, выдаваемые областям и городу Ташкенту'),
                                                             (176, 4911330, 'Ссуды, выдаваемые районам и городам'),
                                                             (177, 4911340, 'Ссуды, выдаваемые Государственным целевым фондам'),
                                                             (178, 4911350, 'Кредиты нефинансовым государственным организациям'),
                                                             (179, 4911360, 'Кредиты негосударственным организациям'),
                                                             (180, 4911370, 'Кредиты финансовым организациям'),
                                                             (181, 4911390, 'Прочее внутреннее кредитование'),
                                                             (182, 4911400, 'Акции и другие формы участия в капитале'),
                                                             (183, 4912100, 'Депозиты'),
                                                             (184, 4912200, 'Ценные бумаги, кроме акций'),
                                                             (185, 4912300, 'Кредиты и займы'),
                                                             (186, 4912400, 'Акции и другие формы участия в капитале'),
                                                             (187, 4921110, 'Погашение казначейских векселей и долгосрочных ценных бумаг'),
                                                             (188, 4921210, 'Погашение ссуд Республиканскому уровню Республики Узбекистан'),
                                                             (189, 4921220, 'Погашение ссуд Республики Каракалпакстан'),
                                                             (190, 4921230, 'Погашение ссуд областям и городу Ташкенту'),
                                                             (191, 4921240, 'Погашение кредитов нефинансовых государственных организаций'),
                                                             (192, 4921250, 'Погашение кредитов негосударственных организаций'),
                                                             (193, 4921260, 'Погашение кредитов финансовых организаций'),
                                                             (194, 4921290, 'Прочее внутреннее погашение кредитов'),
                                                             (195, 4921310, 'Средства, передаваемые по взаимным расчетам Республиканскому уровню'),
                                                             (196, 4921320, 'Средства, передаваемые по взаимным расчетам Республике Каракалпакстан'),
                                                             (197, 4921330, 'Средства, передаваемые по взаимным расчетам областям и городу Ташкенту'),
                                                             (198, 4921340, 'Средства, передаваемые по взаимным расчетам районам и городам'),
                                                             (199, 4921350, 'Средства, передаваемые в вышестоящие бюджеты'),
                                                             (200, 4921360, 'Суммы излишков доходов, передаваемые в вышестоящие бюджеты'),
                                                             (201, 4921400, 'Акции и другие формы участия в капитале'),
                                                             (202, 4922110, 'Погашение казначейских векселей и долгосрочных ценных бумаг'),
                                                             (203, 4922210, 'Погашение кредитов иностранных правительств'),
                                                             (204, 4922220, 'Погашение кредитов международных организаций'),
                                                             (205, 4922230, 'Погашение кредитов финансовых организаций, кроме международных организаций'),
                                                             (206, 5555555, 'сумма бюджетных средств, сэкономленных на конец последнего рабочего дня отчетного ...'),
                                                             (207, 4111299, 'Прочие надбавки и доплаты к заработной плате'),
                                                             (208, 4821180, 'Целевые расходы'),
                                                             (209, 4354940, 'Приобретение учебно-лабораторного оборудования'),
                                                             (210, 4252130, 'Приобретение прочей полиграфической'),
                                                             (211, 4921120, 'Погашение среднесрочных ценных бумаг'),
                                                             (212, 4921190, 'Погашение прочих ценных бумаг'),
                                                             (213, 4355900, 'Прочие расходы по приобретению основных средств'),
                                                             (214, 4641290, 'Другие единицы сектора государственного управления дополнить'),
                                                             (215, 4252440, 'Лекарства и изделия медицинского назначения, имеющие социальное значение'),
                                                             (216, 4641250, 'Другие внебюджетные фонды дополнить'),
                                                             (217, 4641340, 'Государственным целевым фондам'),
                                                             (218, 4641410, 'Целевые социальные трансферты в Республику Коракалпогистан'),
                                                             (219, 4641420, 'Целевые социальные трансферты в области и город Ташкент'),
                                                             (220, 4641430, 'Целевые социальные трансферты в район и города'),
                                                             (221, 4252700, 'Продукты питания для зимне-весеннего сезона'),
                                                             (222, 4354950, 'Отопительные котлы'),
                                                             (223, 4234950, 'Отопительные котлы'),
                                                             (224, 4333200, 'Отопительные котлы'),
                                                             (225, 4111230, 'Фонд материального поощрения работников дошкольных образовательных учреждений'),
                                                             (226, 4821140, 'Расходы заклада за участие в электронных государственных закупках'),
                                                             (227, 4354960, 'Спортивный инвентарь и оборудование'),
                                                             (228, 4641440, 'Регулятивные межбюджетные трансферты'),
                                                             (229, 4111240, 'Доплаты работникам с учеными степенями'),
                                                             (230, 4721700, 'Материальная помощь нуждающимся семьям во время пандемии'),
                                                             (231, 4252411, 'Медикаменты'),
                                                             (232, 4252412, 'Реактивы и реагенты для медицинского оборудования и расходных материалов'),
                                                             (233, 4252413, 'Дезинфицирующие средства и средства индивидуальной защиты'),
                                                             (234, 4642310, 'Государственные фонды'),
                                                             (235, 4642320, 'Другие целевые фонды'),
                                                             (236, 4641510, 'Государственные фонды'),
                                                             (237, 4821800, 'Расходы на формирование фонда поощрения работников народного образования'),
                                                             (238, 4721500, 'Ежемесячные компенсационные выплаты за жилищно-коммунальные услуги'),
                                                             (239, 4412220, 'Нерезидент'),
                                                             (240, 4711180, 'Пенсия тайинлаш учун зарур булган иш стажига эга булмаган шахсларга ва мехнатга ...'),
                                                             (241, 4299980, 'Давлат хусусий шерикчилик асосидаги харажатлар'),
                                                             (242, 4821410, 'Выплаты из Фонда материального стимулирования студентов');

-- --------------------------------------------------------

--
-- Структура таблицы `contractors`
--

CREATE TABLE `contractors` (
                               `id` bigint UNSIGNED NOT NULL,
                               `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
                               `bank_name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
                               `bank_account` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
                               `tin` varchar(9) COLLATE utf8mb4_unicode_ci NOT NULL,
                               `bank_code` varchar(5) COLLATE utf8mb4_unicode_ci NOT NULL,
                               `created_at` timestamp NULL DEFAULT NULL,
                               `updated_at` timestamp NULL DEFAULT NULL,
                               `deleted_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `contractors`
--

INSERT INTO `contractors` (`id`, `name`, `bank_name`, `bank_account`, `tin`, `bank_code`, `created_at`, `updated_at`, `deleted_at`) VALUES
                                                                                                                                        (1, '\'O‘ZBEKISTON RESPUBLIKASI IQTISODIYOT VA MOLIYA VAZIRLIGI\' DAVLAT MUASSASASI', 'Клиринговый центр розничных платежей Центрального банка', '1321231231231231', '232323233', '00002', '2025-01-15 05:46:43', '2025-01-15 05:46:43', NULL),
                                                                                                                                        (2, 'YaTT \"Pulatov R.X.\"', 'Клиринговый центр мгновенных платежей Центрального банка', '45453453', '45453453', '00003', '2025-01-15 11:29:42', '2025-01-15 11:29:42', NULL),
                                                                                                                                        (3, 'avtotexxizmat MCHJ', 'Мубарекский филиал АКБ \"Агробанк\"', '34534534', '3456345', '00187', '2025-01-15 11:53:09', '2025-01-15 11:53:09', NULL);

-- --------------------------------------------------------

--
-- Структура таблицы `contracts`
--

CREATE TABLE `contracts` (
                             `id` bigint UNSIGNED NOT NULL,
                             `registration_number` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
                             `registration_date` date NOT NULL,
                             `type` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
                             `number` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
                             `date` date NOT NULL,
                             `contractor` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
                             `category` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
                             `details` text COLLATE utf8mb4_unicode_ci,
                             `article` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
                             `amount` decimal(20,2) UNSIGNED DEFAULT '0.00',
                             `term` date DEFAULT NULL,
                             `status` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
                             `created_at` timestamp NULL DEFAULT NULL,
                             `updated_at` timestamp NULL DEFAULT NULL,
                             `deleted_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `contracts`
--

INSERT INTO `contracts` (`id`, `registration_number`, `registration_date`, `type`, `number`, `date`, `contractor`, `category`, `details`, `article`, `amount`, `term`, `status`, `created_at`, `updated_at`, `deleted_at`) VALUES
                                                                                                                                                                                                                               (1, '4324234234', '2025-01-16', 'Импортные контракты', '234234234', '2025-01-16', 'YaTT \"Pulatov R.X.\"', 'asdfsasfsadfsd', '24323424', '4239000', 4645.00, '2025-02-14', NULL, '2025-01-15 05:47:16', '2025-01-16 05:39:12', NULL),
                                                                                                                                                                                                                               (2, '76878678', '2025-01-15', 'Разовый', '678678', '2025-01-15', 'YaTT \"Pulatov R.X.\"', 'asdfsasfsadfsd', NULL, NULL, 3422342.00, '2025-01-27', NULL, '2025-01-15 05:48:08', '2025-01-15 11:46:08', NULL),
                                                                                                                                                                                                                               (3, '45454', '2025-01-15', 'Разовый', '45453', '2025-01-15', 'YaTT \"Pulatov R.X.\"', 'asdfsasfsadfsd', NULL, NULL, 234243424.00, '2025-01-23', NULL, '2025-01-15 07:26:04', '2025-01-15 11:46:57', NULL),
                                                                                                                                                                                                                               (4, '1221', '2025-01-15', 'Годовой', '4545', '2025-01-15', '\'O‘ZBEKISTON RESPUBLIKASI IQTISODIYOT VA MOLIYA VAZIRLIGI\' DAVLAT MUASSASASI', NULL, NULL, NULL, 0.00, '2025-01-15', NULL, '2025-01-15 09:26:08', '2025-01-15 09:26:08', NULL),
                                                                                                                                                                                                                               (5, '1221', '2025-01-15', 'Разовый', '4545', '2025-01-15', 'YaTT \"Pulatov R.X.\"', NULL, NULL, NULL, 12.00, '2025-01-17', NULL, '2025-01-15 09:26:26', '2025-01-15 11:47:15', NULL),
                                                                                                                                                                                                                               (6, '1221', '2025-01-15', 'Импортные контракты', '4545', '2025-01-15', '\'O‘ZBEKISTON RESPUBLIKASI IQTISODIYOT VA MOLIYA VAZIRLIGI\' DAVLAT MUASSASASI', 'asdfsasfsadfsd', NULL, NULL, 0.00, '2025-01-30', NULL, '2025-01-15 09:26:42', '2025-01-15 09:34:55', NULL),
                                                                                                                                                                                                                               (7, '34453453', '2025-01-15', 'Годовой', '3453453453', '2025-01-15', '\'O‘ZBEKISTON RESPUBLIKASI IQTISODIYOT VA MOLIYA VAZIRLIGI\' DAVLAT MUASSASASI', NULL, NULL, '4111230', 0.00, '2025-01-15', NULL, '2025-01-15 10:44:04', '2025-01-15 10:44:04', NULL),
                                                                                                                                                                                                                               (8, '45454', '2025-01-16', 'Разовый', '77777777777', '2025-01-16', 'YaTT \"Pulatov R.X.\"', NULL, NULL, NULL, 7777777777.00, '2025-01-21', NULL, '2025-01-15 10:45:15', '2025-01-16 04:48:11', NULL),
                                                                                                                                                                                                                               (9, '78674867', '2025-01-15', 'Годовой', '786786', '2025-01-15', 'YaTT \"Pulatov R.X.\"', NULL, NULL, NULL, 0.00, '2025-01-15', NULL, '2025-01-15 11:44:33', '2025-01-15 11:44:33', NULL),
                                                                                                                                                                                                                               (10, '7687867867', '2025-01-15', 'Импортные контракты', '86786768', '2025-01-15', 'YaTT \"Pulatov R.X.\"', NULL, NULL, NULL, 7867.00, '2025-01-15', NULL, '2025-01-15 11:44:50', '2025-01-15 11:44:50', NULL),
                                                                                                                                                                                                                               (11, '45454', '2025-01-15', 'Годовой', '78676', '2025-01-15', 'YaTT \"Pulatov R.X.\"', NULL, '78678676', NULL, 786786786.00, '2025-01-26', NULL, '2025-01-15 11:45:16', '2025-01-15 11:45:16', NULL),
                                                                                                                                                                                                                               (12, '1221', '2025-01-15', 'Годовой', '45453', '2025-01-15', 'avtotexxizmat MCHJ', 'Benzin 91', NULL, '4252500', 90000000.00, '2025-01-15', NULL, '2025-01-15 13:07:30', '2025-01-15 13:07:30', NULL),
                                                                                                                                                                                                                               (13, 'r56yrth', '2025-01-16', 'Годовой', 'rtrft', '2025-01-16', 'YaTT \"Pulatov R.X.\"', 'Benzin 95', 'yjrtfjrfgjhfgjfgjhfgjhghjgh', '4252500', 5454546544.00, '2025-12-31', NULL, '2025-01-16 05:37:32', '2025-01-16 05:37:32', NULL);

-- --------------------------------------------------------

--
-- Структура таблицы `contract_categories`
--

CREATE TABLE `contract_categories` (
                                       `id` bigint UNSIGNED NOT NULL,
                                       `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
                                       `created_at` timestamp NULL DEFAULT NULL,
                                       `updated_at` timestamp NULL DEFAULT NULL,
                                       `deleted_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `contract_categories`
--

INSERT INTO `contract_categories` (`id`, `name`, `created_at`, `updated_at`, `deleted_at`) VALUES
                                                                                               (1, '\'O‘ZBEKISTON RESPUBLIKASI IQTISODIYOT VA MOLIYA VAZIRLIGI\' DAVLAT MUASSASASI', '2025-01-15 05:46:52', '2025-01-15 05:46:52', NULL),
                                                                                               (2, 'sdvsdv423452345234234234234', '2025-01-15 07:27:51', '2025-01-15 11:35:10', NULL),
                                                                                               (3, 'sdfsdfsdcsdcs', '2025-01-15 11:34:59', '2025-01-15 11:34:59', NULL),
                                                                                               (4, 'Benzin 91', '2025-01-15 13:06:48', '2025-01-15 13:06:48', NULL),
                                                                                               (5, 'Benzin 95', '2025-01-15 13:06:59', '2025-01-15 13:06:59', NULL);

-- --------------------------------------------------------

--
-- Структура таблицы `failed_jobs`
--

CREATE TABLE `failed_jobs` (
                               `id` bigint UNSIGNED NOT NULL,
                               `uuid` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
                               `connection` text COLLATE utf8mb4_unicode_ci NOT NULL,
                               `queue` text COLLATE utf8mb4_unicode_ci NOT NULL,
                               `payload` longtext COLLATE utf8mb4_unicode_ci NOT NULL,
                               `exception` longtext COLLATE utf8mb4_unicode_ci NOT NULL,
                               `failed_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `migrations`
--

CREATE TABLE `migrations` (
                              `id` int UNSIGNED NOT NULL,
                              `migration` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
                              `batch` int NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `migrations`
--

INSERT INTO `migrations` (`id`, `migration`, `batch`) VALUES
                                                          (127, '2014_10_12_000000_create_users_table', 1),
                                                          (128, '2014_10_12_100000_create_password_resets_table', 1),
                                                          (129, '2019_08_19_000000_create_failed_jobs_table', 1),
                                                          (130, '2019_12_14_000001_create_personal_access_tokens_table', 1),
                                                          (131, '2025_01_07_160945_create_contractors_table', 1),
                                                          (132, '2025_01_10_121818_create_contract_categories_table', 1),
                                                          (133, '2025_01_10_165331_change_contractors_table', 1),
                                                          (134, '2025_01_13_051428_create_contracts_table', 1);

-- --------------------------------------------------------

--
-- Структура таблицы `organizations`
--

CREATE TABLE `organizations` (
                                 `ID` int UNSIGNED NOT NULL,
                                 `organization_name` varchar(225) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL,
                                 `taxpayer_identification_number` int NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `organizations`
--

INSERT INTO `organizations` (`ID`, `organization_name`, `taxpayer_identification_number`) VALUES
                                                                                              (1, 'O‘ZBEKISTON RESPUBLIKASI PREZIDENTI DAVLAT XAVFSIZLIK XIZMATI', 207273386),
                                                                                              (2, 'YETMISH YETTI OLTI YUZ BIRINCHI SONLI HARBIY QISM', 207273426);

-- --------------------------------------------------------

--
-- Структура таблицы `password_resets`
--

CREATE TABLE `password_resets` (
                                   `email` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
                                   `token` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
                                   `created_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `personal_access_tokens`
--

CREATE TABLE `personal_access_tokens` (
                                          `id` bigint UNSIGNED NOT NULL,
                                          `tokenable_type` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
                                          `tokenable_id` bigint UNSIGNED NOT NULL,
                                          `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
                                          `token` varchar(64) COLLATE utf8mb4_unicode_ci NOT NULL,
                                          `abilities` text COLLATE utf8mb4_unicode_ci,
                                          `last_used_at` timestamp NULL DEFAULT NULL,
                                          `created_at` timestamp NULL DEFAULT NULL,
                                          `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `users`
--

CREATE TABLE `users` (
                         `id` bigint UNSIGNED NOT NULL,
                         `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
                         `email` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
                         `email_verified_at` timestamp NULL DEFAULT NULL,
                         `password` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
                         `remember_token` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
                         `created_at` timestamp NULL DEFAULT NULL,
                         `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `banks`
--
ALTER TABLE `banks`
    ADD PRIMARY KEY (`ID`),
  ADD UNIQUE KEY `bank_code_UNIQUE` (`bank_code`);

--
-- Индексы таблицы `bank_accounts`
--
ALTER TABLE `bank_accounts`
    ADD PRIMARY KEY (`ID`),
  ADD KEY `organization_fk_idx` (`organization_id`);

--
-- Индексы таблицы `chart_of_accounts`
--
ALTER TABLE `chart_of_accounts`
    ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `classificator`
--
ALTER TABLE `classificator`
    ADD PRIMARY KEY (`ID`),
  ADD UNIQUE KEY `article_UNIQUE` (`article`);

--
-- Индексы таблицы `contractors`
--
ALTER TABLE `contractors`
    ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `contractors_tin_unique` (`tin`);

--
-- Индексы таблицы `contracts`
--
ALTER TABLE `contracts`
    ADD PRIMARY KEY (`id`),
  ADD KEY `contracts_amount_index` (`amount`);

--
-- Индексы таблицы `contract_categories`
--
ALTER TABLE `contract_categories`
    ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `failed_jobs`
--
ALTER TABLE `failed_jobs`
    ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `failed_jobs_uuid_unique` (`uuid`);

--
-- Индексы таблицы `migrations`
--
ALTER TABLE `migrations`
    ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `organizations`
--
ALTER TABLE `organizations`
    ADD PRIMARY KEY (`ID`);

--
-- Индексы таблицы `password_resets`
--
ALTER TABLE `password_resets`
    ADD KEY `password_resets_email_index` (`email`);

--
-- Индексы таблицы `personal_access_tokens`
--
ALTER TABLE `personal_access_tokens`
    ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `personal_access_tokens_token_unique` (`token`),
  ADD KEY `personal_access_tokens_tokenable_type_tokenable_id_index` (`tokenable_type`,`tokenable_id`);

--
-- Индексы таблицы `users`
--
ALTER TABLE `users`
    ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `users_email_unique` (`email`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `banks`
--
ALTER TABLE `banks`
    MODIFY `ID` int UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=377;

--
-- AUTO_INCREMENT для таблицы `bank_accounts`
--
ALTER TABLE `bank_accounts`
    MODIFY `ID` int UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;

--
-- AUTO_INCREMENT для таблицы `chart_of_accounts`
--
ALTER TABLE `chart_of_accounts`
    MODIFY `id` int UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=560;

--
-- AUTO_INCREMENT для таблицы `classificator`
--
ALTER TABLE `classificator`
    MODIFY `ID` int UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=243;

--
-- AUTO_INCREMENT для таблицы `contractors`
--
ALTER TABLE `contractors`
    MODIFY `id` bigint UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT для таблицы `contracts`
--
ALTER TABLE `contracts`
    MODIFY `id` bigint UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=14;

--
-- AUTO_INCREMENT для таблицы `contract_categories`
--
ALTER TABLE `contract_categories`
    MODIFY `id` bigint UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT для таблицы `failed_jobs`
--
ALTER TABLE `failed_jobs`
    MODIFY `id` bigint UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `migrations`
--
ALTER TABLE `migrations`
    MODIFY `id` int UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=135;

--
-- AUTO_INCREMENT для таблицы `organizations`
--
ALTER TABLE `organizations`
    MODIFY `ID` int UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT для таблицы `personal_access_tokens`
--
ALTER TABLE `personal_access_tokens`
    MODIFY `id` bigint UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `users`
--
ALTER TABLE `users`
    MODIFY `id` bigint UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- Ограничения внешнего ключа сохраненных таблиц
--

--
-- Ограничения внешнего ключа таблицы `bank_accounts`
--
ALTER TABLE `bank_accounts`
    ADD CONSTRAINT `organization_fk` FOREIGN KEY (`organization_id`) REFERENCES `organizations` (`ID`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
